{
  "directed": true,
  "multigraph": false,
  "graph": {
    "session_id": "54735816",
    "original_query": "You are a stock researcher, prepare a very very detailed and comprehensive report on Asian Paints. You must include graphs, tables, comparisons. Finally you must share a well formatted and polished HTML report. You get extra money for making the report very comprehensive and visually appealing! (use Report Generator Agent directly to generate charts, tables and HTML report). Hint: For graphs, and tables, you must first collect relevant data sources (revenue trend, market share etc.) and then use Coder Agent to generate the graphs",
    "file_manifest": [],
    "created_at": "2025-08-09T10:36:56.060258",
    "status": "running",
    "output_chain": {
      "T001": {
        "asian_paints_overview": [
          {
            "type": "text",
            "text": "[{'url': 'https://www.asianpaints.com/about-us.html', 'content': 'About Asian Paints - 75+ Years Of Innovation In Paints Asian Paints - About Us Colours Colour by family All Colours Grey Blue Brown Red Orange Yellow Green Purple Pink Whites Off Whites Colour Collections Royale Designer Colour of the year Colour Tools Home Colour Guide Wall Paint Finder Wood Paint Finder Wood Finish Visualiser Textures For You New Shade Cards New Inspirations Colour combinations Celebrity homes Products For Interior Walls Paints Textures Wallpapers For Exterior Walls Paints Textures Waterproofing All products Bathrooms Terrace & tanks Cracks & joints Interior Tiling Exteriors Other Surface Wood paints Metal paints Undercoats Adhesives Brushes & Ancillaries Shop DIY Tools Mechanized tools Colour books Royale play texture tool Services Painting Interior solutions Waterproofing Sleek Kitchen Bathroom design & execution Calculators Paint budget calculator Waterproofing budget calculator Interior design cost calculator Kitchen cost calculator Sustainability More Find Contractor Find a store Blogs Guides Paint bucket return Explore home decor Our Company Investors Careers Contact us Search for Get recommendations for Colour inspiration,Textures, Wallpapers, Interior Design ideas, etc... Drag & drop your image here or Browse an image Max file size limit is 5MB Only JPG, JPEG and PNG file formats are allowed Please upload only 1 file Oops file upload failed, please try again!!! Search with a photo Get recommendations for Colour inspiration,Textures, Wallpapers, Interior Design ideas, etc... Gallery - Choose an existing photo Camera - Click a photo Max file size limit is 5MB Oops file upload failed, please try again!!! Uploading... Find Contractor Store Profile Hello My Profile Wishlist Sign out Hello {{minicart.cartcount > 0 ? minicart.cartcount : 0}} Cart Processing... You have {{minicart.cartcount}} items {{item[\"totalPrice\"][\"value\"]}} - + Total Amount {{minicart.totalprice}} Checkout Your cart is empty Shop now Book Free Site Visit Colours Colour by family All Colours Grey Blue Brown Red Orange Yellow Green Purple Pink Whites Off Whites Colour Collections Royale Designer Colour of the year Colour Tools Home Colour Guide Wall Paint Finder Wood Paint Finder Wood Finish Visualiser Textures For You New Shade Cards New Inspirations Colour combinations Celebrity homes Products For Interior Walls Paints Textures Wallpapers For Exterior Walls Paints Textures Waterproofing All products Bathrooms Terrace & tanks Cracks & joints Interior Tiling Exteriors Other Surface Wood paints Metal paints Undercoats Adhesives Brushes & Ancillaries Shop DIY Tools Mechanized tools Colour books Royale play texture tool Services Painting Interior solutions Waterproofing Sleek Kitchen Bathroom design & execution Calculators Paint budget calculator Waterproofing budget calculator Interior design cost calculator Kitchen cost calculator Sustainability More... Find Contractor Find a store Blogs Guides Paint bucket return Explore home decor Our Company Investors Careers Contact us Book Free Site Visit Get recommendations for Colour inspiration,Textures, Wallpapers, Interior Design ideas, etc... Drag & drop your image here or Browse an image Max file size limit is 5MB Only JPG, JPEG and PNG file formats are allowed Please upload only 1 file Oops file upload failed, please try again!!! Search with a photo Get recommendations for Colour inspiration,Textures, Wallpapers, Interior Design ideas, etc... Gallery - Choose an existing photo Camera - Click a photo Max file size limit is 5MB Oops file upload failed, please try again!!! Uploading... ABOUT ASIAN PAINTS 75+ Years ofInnovation in Paint HISTORY All Great Things Start Small The company has come a long way since its small beginnings in 1942. It was set up as a partnership firm by four friends who were willing to take on the world\\'s biggest, most famous paint companies operating in India at that time. Over the course of 25 years, Asian Paints became a corporate force and India\\'s leading paints c', 'images': [{'url': 'https://static.asianpaints.com/content/dam/apcolourcatalogue/splash-popup/mobile-home-decor-image.webp', 'alt_text': 'mobile-home-decor-image', 'width': '290', 'height': '260', 'loading': 'eager', 'confidence': 0.8999999999999999}, {'url': 'https://static.asianpaints.com/content/dam/apcolourcatalogue/splash-popup/mobile-paint-textures-image-40.webp', 'alt_text': 'mobile-paint-textures-image-40', 'width': '290', 'height': '260', 'loading': 'eager', 'confidence': 0.8999999999999999}, {'url': 'https://static.asianpaints.com/content/dam/apcolourcatalogue/asset/ap-revamp/static-pages/about-us/desktop-images/mascot.png', 'alt_text': 'A sketch of a man with a paint brush in his hand', 'title': 'A sketch of a man with a paint brush in his hand', 'loading': 'eager', 'confidence': 0.7}, {'url': 'https://static.asianpaints.com/content/dam/asianpaints/website/secondary-navigation/about-us/board-of-directors/RSeshasayee1.jpg', 'alt_text': 'R Seshasayee - Non-Executive Chairman / Independent', 'title': 'R Seshasayee - Non-Executive Chairman / Independent', 'loading': 'eager', 'confidence': 0.7}, {'url': 'https://static.asianpaints.com/content/dam/asianpaints/website/secondary-navigation/about-us/board-of-directors/Manish.jpg', 'alt_text': 'Manish Choksi - Non-Executive Vice Chairman', 'title': 'Manish Choksi - Non-Executive Vice Chairman', 'loading': 'eager', 'confidence': 0.7}], 'rank': 1}, {'url': 'https://en.wikipedia.org/wiki/Asian_Paints', 'content': \"Asian Paints - Wikipedia Home Random Nearby Log in Settings Donate Now If Wikipedia is useful to you, please give today. About Wikipedia Disclaimers Search Asian Paints Article Talk Language Watch Edit Asian Paints Ltd is an Indian multinational paint company, headquartered in Mumbai . [ 2 ] The company is engaged in the business of manufacturing, selling and distribution of paints, coatings, products related to home dcor, bath fittings and providing related services. Asian Paints Ltd. Formerly Asian Oil and Paint Company Pvt. Ltd. (19451965) [ 1 ] Asian Paints (India) Pvt. Ltd. (19651973) [ 1 ] Company type Public Traded as BSE : 50082 NSE : ASIANPAINT BSE SENSEX constituent NSE NIFTY 50 constituent ISIN INE021A01026 Industry Chemicals Founded 1February 1942 ; 83 years ago ( 1942-02-01 ) Founders Champaklal Choksey Chimanlal Choksi Suryakant Dani Arvind Vakil [ 2 ] Headquarters Mumbai , Maharashtra , India Area served Worldwide Key people Manish Choksi ( Vice Chairman ) Amit Syngle ( CEO ) Products Chemicals Decorative paints Industrial finishing products Coatings Revenue 36,183 crore (US$4.3billion) (2024) Operating income 7,215 crore (US$850million) (2024) Net income 5,558 crore (US$660million) (2024) Total assets 29,924 crore (US$3.5billion) (2024) Total equity 19,424 crore (US$2.3billion) (2024) Number of employees 9,482 permanent & 21,189 contractual (2024) [ 3 ] Website asianpaints.com Footnotes/ references Financials as of 31March2024 [update] . [ 4 ] Asian Paints is India's largest paints company by market share. [ 5 ] [ 6 ] The company has 27 paint manufacturing facilities in 15 countries, servicing consumers in over 60 countries. Asian Paints is also present in the home improvement and dcor space in India. [ 7 ] Contents 1 History 2 Corporate structure 2.1 Ownership 2.2 Shareholding pattern 3 Manufacturing locations 4 Marketing and advertising 5 References 6 External links History edit The company was started in a garage in Gaiwadi, Girgaon , Mumbai by four friends Champaklal Choksey, Chimanlal Choksi, Suryakant Dani and Arvind Vakil, in February 1942. [ 2 ] During World War II and the Quit India Movement of 1942, a temporary ban on paint imports left only foreign companies and Shalimar Paints in the market. Asian Paints took up the market and reported an annual turnover of 23 crore in 1952 but with only 2% PBT margin. By 1967, it became the leading paints manufacturer in the country. [ 8 ] [ 9 ] Asian Paints established its first overseas subsidiary in 1978 in Fiji , [ 10 ] before expanding into Nepal in 1983. [ 11 ] The company made its first international acquisition in 1999, when it took over Sri Lanka 's second largest paint company, Delmege Forsyth & Co. [ 12 ] In 2000, it began operations in Oman through a joint venture with the Al Hassan Group. [ 13 ] In 2002, Asian Paints acquired a 60% stake in Egyptian paint manufacturer SCIB Chemicals for 24.5 crore (US$5.04 million). [ 14 ] It also acquired a 50.1% stake in the SGX -listed Berger International Singapore, which had operations in 11 countries across Southeast Asia , West Asia , the Caribbean , China and Malta , for US$20.8 million. [ 15 ] Later that year, it entered the Bangladesh market by incorporating a joint venture with Confidence Group . [ 16 ] In 2003, it acquired Taubmans Paints, which functioned in Fiji and Samoa ; this added to Asian Paints' existing presence in the region under Apco Coatings brand in Fiji, Solomon Islands , Vanuatu and Tonga . [ 17 ] In 2004, the company sold its stake in the Malta subsidiary, which was its only venture in Europe. [ 18 ] By 2010, it ceased its loss-making operations in Malaysia, Hong Kong, Thailand and China. [ 19 ] In 2013, Asian Paints increased its stake in Berger International Singapore to 96.48%. [ 20 ] In 2014, it entered Indonesia through the Singapore subsidiary. [ 21 ] In India, the company ventured into home improvement and dcor with the acquisitions of modular kitchen manufacturer Sleek Intern\", 'images': [], 'rank': 2}, {'url': 'https://www.linkedin.com/pulse/evolution-asian-paints-business-strategy-through-decades-suraj-jha-rfwcf', 'content': 'The Evolution of Asian Paints\\' Business Strategy Through the Decades Agree & Join LinkedIn By clicking Continue to join or sign in, you agree to LinkedIns User Agreement , Privacy Policy , and Cookie Policy . Sign in to view more content Create your free account or sign in to continue your search Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIns User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIns User Agreement , Privacy Policy , and Cookie Policy . Skip to main content LinkedIn Join now Sign in Source : INTERNET The Evolution of Asian Paints\\' Business Strategy Through the Decades Report this article Close menu Suraj Jha Suraj Jha Assistant Manager at JSW Paints Published Jan 24, 2025 + Follow Asian Paints, a household name in India and one of the largest paint manufacturers in the world, has built a legacy of excellence over eight decades. Its journey from a modest paint company to a global leader in home dcor is a story of visionary strategy, innovation, and adaptability. Lets explore how its business strategy evolved through the decades. 19421960s: Foundation and Market Focus Founded in 1942 by four friends, Asian Paints started as a small enterprise, focusing on supplying paints to Indian households during World War II. Its first strategic move was targeting domestic consumers rather than industrial clients , which was the norm for most competitors. The company emphasized affordability and availability, setting itself apart in a market dominated by global players. By the 1950s, Asian Paints adopted a decentralized production strategy to serve a geographically diverse market. This allowed it to respond quickly to demand across the country, even in remote areas. 1970s1980s: Distribution as a Competitive Advantage In the 1970s, Asian Paints revolutionized the industry with its dealer-centric distribution model , ensuring paint availability in rural and urban markets alike. The company built a robust network of dealers, enabling faster product delivery and better customer service. To support its growing scale, Asian Paints also invested in technology-led supply chain management , such as deploying IT systems for real-time inventory tracking. This gave it an edge over competitors who relied on outdated manual systems. The iconic mascot \"Gattu\" was introduced in 1954 and remained central to its branding strategy for decades, making the brand synonymous with trust and quality in Indian households. 1990s: Branding and Customer-Centric Innovation With liberalization in the 1990s, Asian Paints embraced branding and marketing innovation to stand out in an increasingly competitive market. It shifted from a functional product focus to creating an emotional connection with consumers. Campaigns like Har Ghar Kuch Kehta Hai (Every home tells a story) positioned the brand as part of every homes journey. Asian Paints also recognized changing consumer behavior and introduced pre-mixed, ready-to-use paints in smaller packs, making it easier for middle-class households to access high-quality products. 2000s: Diversification and Digital Transformation In the 2000s, Asian Paints expanded its vision from being just a paint manufacturer to becoming a home dcor solutions provider . This was achieved through vertical and horizontal diversification: Recommended by LinkedIn The Global Furniture Industry in 2024: Trends Gaurav Mehta 1 month ago The Acceptable Strategy M. Ik Deliorman, CCMP, MA 1 year ago IKEA Business Case Study: How to Earn $40 Billion Ravi Kanth Satyala 12 months ago The launch of Asian Paints Home Solutions , providing painting services and consultations. Entry into related segments like wallpapers, waterproofing solutions, and furniture coatings. The company also embraced digital transformation , launching tools like the C', 'images': [], 'rank': 3}, {'url': 'https://economictimes.indiatimes.com/asian-paints-ltd/infocompanyhistory/companyid-14034.cms', 'content': \"Asian Paints History | Asian Paints Information - The Economic Times Benchmarks Nifty 24,363.30 -232.86 FEATURED FUNDS UTI Aggressive Hybrid Fund Regular Plan-Growth 5Y Return 19.69 % Invest Now FEATURED FUNDS  HSBC Large Cap Fund Direct-Growth 5Y Return 18.17 % Invest Now Enter search text: English Edition English Edition     | 09 August, 2025, 04:04 PM IST | Today's ePaper My Watchlist Subscribe Sign In Home ETPrime Markets Market Data AI Masterclass News Industry SME Politics Wealth MF Tech AI Careers Opinion NRI Panache More Menu Stocks News Live Blog Stock Live Blog Earnings Podcast Market Classroom Dons of Dalal Street Recos Stock Reports Plus New My Screener Candlestick Screener Stock Screener Stock Watch Market Calendar Stock Price Quotes Options IPOs/FPOs Expert Views Investment Ideas Commodities Views News Others Mentha Oil Precious Metals Gold M Gold Silver Gold Petal Silver Micro Silver M Gold Guinea Spices Cardamom Oil & Energy Natural Gas Crude Oil Crude Oil Mini Base Metals Aluminium Zinc Mini Lead Mini Copper Zinc Nickel Aluminium Mini Lead Plantation Kapas Cotton Candy Cotton Forex Forex News Currency Converter Live Stream! AIF PMS Crypto Crypto News Crypto TV Crypto Prices Bonds More Digital Real Estate Realty News Technicals Technical Chart Visualize Screener Mind Over Money Web Stories Markets Data Unlisted Companies Market Moguls Webinars Sitemap Definitions Business News Markets Stocks Stock Price Quotes Asian Paints Share Price Asian Paints History Summary Prices Financials Reports Company Info News Competitors History Management Background Listing Locations Board Meetings AGM/EGM Dividends Bonus Rights Splits IPO ET 500 Rank 2021 74 Asian Paints History BSE: 500820 | NSE: ASIANPAINTEQ | IND: Paints/Varnishes | ISIN code: INE021A01026 | SECT: Building Materials PREMARKET BSE Change: Volume: Open: Prv. Close: Today: 52-Wk: Bid: ( ) Offer: ( ) NSE Change: Volume: Open: Prv. Close: Today: 52-Wk: Bid: ( ) Offer: ( ) The Company History page lists out the major events in chronological order for Asian Paints Ltd. Company History - Asian Paints Ltd. 1945 - The Company was incorporated as a private limited company under the name of Asian Oil and Paint Company Pvt. Ltd. It was converted into a public limited company in 1973. The Company manufacture a wide range of surface coatings catering to different end-uses. It also manufactures vinyl pyridine latex used in the manufacture of rubber tyres. - The company expanded its products range, developed its own technology, set up a distribution network penetrating in smaller towns and ploughed back a large part of earnings into creation of new facilities. 1965 - The name was changed from Asian Oil and Paint Company Pvt. Ltd. to Asian Paints (India) Pvt. Ltd. 1974 - A major modernisation programme was undertaken to streamline the paint production facilities by improving the layout of machines, addition to balancing equipment and replacement of old machinery. The Company embarked on phased modernisation of resin manufacturing facilities as well. - The Bhandup plant of the Company is reportedly the largest single paint factory in the country and one of the most up-to-date with sophisticated machinery and equipment for manufacturing a wide range of paints and other products besides adequate resin manufacturing capacity to meet its entire requirements. 1975 - Bonus Equity shares issued in the prop. 1:2 in 1961, 1:3 in 1962, 1:1 in 1966, 1:2 in 1969, 2:3 in 1971 and 1:2 in 1975. 1978 - 1,00,000 Bonus Equity shares issued in the prop. 2:3. 1980 - 50,000 unclassified shares classified as prefernece shares and issued. They are redeemable during the period 30.6.1987/1990. 1982 - The main objects of the public issue of capital during August, were to fulfill the listing requirements of the Stock Exchange and to provide part of the finance for the increased operations. 1983 - Equity shares subdivided. 10,00,000 Bonus shares issued in prop. 2:5, 16,85,185 No. of Equ\", 'images': [], 'rank': 4}, {'url': 'https://enrichmoney.in/blog-article/asian-paints-history-subsidiaries-and-share-price', 'content': \"Asian Paints: History, Latest Updates, Milestones, Subsidiaries & Share Price About Research Equity Report Nifty and Bank Nifty Market Outlooks Commodity Report Gold, Crude Oil, Silver, Natural Gas, etc Live Level Support, Resistance and Pivot Levels Expert Webinar Online Sessions from Industry Experts Knowledge Center Learn Fundamental and Technical Analysis Pricing Orca Partner Login Open Demat Blog Stocks Asian Paints: History, Latest Updates, Milestones, Subsidiaries & Share Price Asian Paints: History, Latest Updates, Milestones, Subsidiaries & Share Price Introduction Asian Paints manufactures a wide range of paints for decoration and industrial use. It offers products for wall coverings, water proofing, adhesives and services too. It also offers interior designing, along with decors for bath and kitchen rooms. It has also included lightnings, furnishings and furniture in its portfolio. Asian Paints has entered into an agreement with Weatherseal Fenestration for engaging in the business of interior decoration / furnishing. The company has also entered into an agreement with White Teak firm to involve in business of decorative lightning products and fans Asian PaintsMoves In 2025: January 2025 Asian Paints witnessed a significant decline in its stock valuation, reaching its lowest point in the past 52 weeks. The downturn was primarily on account of muted investor sentiments and prevailing market woes, placing pressure on the stock's performance against benchmark indices. February 2025 The Q3 FY25 results of the company reported a year-over-year fall in net profit by more than 20%. Operating margins also narrowed on account of higher input costs and competitive pricing, leading to concerns over future earnings momentum. March 2025 Asian Paints initiated leadership changes in its global operations. Joseph Eapen was elevated to head its global business, a decision to enhance the company's international presence and consolidate expansion plans. April 2025 Increased competition from Aditya Birla's recently introduced brand 'Birla Opus' started affecting Asian Paints' market position. The aggressive pricing policy of the competitor put pressure on the decorative paints segment. May 2025 In Q4 FY25, Asian Paints reported a steep decline in profitalmost 45% lower year-on-yearbecause of soft domestic demand and a one-time loss associated with exiting its Indonesia business. Asian Paints Moves In 2023-2024: Asian Paints has made an announcement of their financial results for the Q1, Q2 and Q3 quarter for the financial year 2024. Asian Paints share price today (23.01.2024) is Rs. 3061.65. Asian Paints share price is also trading at a bearish price change of -2.61%. Evolution Of Asian Paints: From Past to Present: Year Evolution 1942 Founding of Asian Paints in Bombay (now Mumbai) by four visionary friends. 1945 Establishment of the company under the name Asian Oil and Paint Company Pvt. Ltd., with a focus on surface coatings and latex for rubber tires. 1965 Change of the company's name to Asian Paints (India) Pvt. Ltd. 1973 Conversion of Asian Paints into a Public Limited Company. 1975 Issuance of bonus equity shares to shareholders. 1985 Expansion with new paint units in Patancheru and collaboration with Nippon Paints for powder coatings. 1987 Entry into synthetic rubber lattices production and receipt of a letter of intent for phthalic anhydride manufacturing. 1988 Issuance of secured non-convertible debentures to financial institutions. 1990 Expansion to Fiji, Tonga, Australia, and collaborations in Nepal and Sri Lanka. 1991 Pentasia Chemicals Ltd. became a subsidiary and later merge into Asian Paints. 1993 Operations expanded to Australia, and a joint venture with Mauritius was established. 1995 Expansion of manufacturing capacities in Visakhapatnam, and collaboration with PT Abadi Coating Solusi, Indonesia. 1996 Formation of a joint venture with PPG Industries, USA, for automotive paints. 1999 Acquisition of a majority stake in\", 'images': [{'url': 'https://fileserver.enrichmoney.in/Content\\\\UploadedFiles\\\\MFXWyIfx-KM85UniE3-zy6f3_20240228102425357.jpg', 'alt_text': 'Asian Paints', 'width': '1000', 'height': '500', 'confidence': 0.8999999999999999}, {'url': 'https://enrichmoney.in/_next/image?url=%2Fimages%2Fhero%2Fwhatsapp.png&w=1920&q=75', 'alt_text': 'Enrich money logo', 'width': '800', 'height': '800', 'loading': 'lazy', 'confidence': 0.8999999999999999}], 'rank': 5}, {'url': 'https://mostvaluablebrands.com/2024/06/asian-paints-a-most-valuable-brand-story/', 'content': '[not extracted] Content limit reached', 'rank': 6}, {'url': 'https://dcfmodeling.com/blogs/history/asianpaintns-history-mission-ownership', 'content': '[not extracted] Content limit reached', 'rank': 7}, {'url': 'https://enlightenedpost.com/behind-the-brand-the-story-of-asian-paints/', 'content': '[not extracted] Content limit reached', 'rank': 8}]",
            "annotations": null
          }
        ]
      },
      "T002": {
        "financial_data": [
          {
            "type": "text",
            "text": "[{'url': 'https://www.moneycontrol.com/financials/asianpaints/ratiosVI/AP31', 'content': 'Asian Paints Key Financial Ratios, Asian Paints Financial Statement & Accounts English Hindi Gujarati Specials Search Quotes, News, Mutual Fund NAVs Trending Stocks NSDL INE301O01023, , 544467 Kalyan Jeweller INE303R01014, KALYANKJIL, 543278 BSE Limited INE118H01025, BSE, 0 Sri Lotus Devel INE0V9Q01010, LOTUSDEV, 544469 Reliance Power INE614G01033, RPOWER, 532939 Quotes Mutual Funds Commodities Futures & Options Currency News Cryptocurrency Forum Notices Videos Glossary All Hello, Login Hello, Login Log-in or Sign-Up My Account My Profile My Portfolio My Watchlist My Alerts My Messages Price Alerts My Profile My PRO My Portfolio My Watchlist My Alerts My Messages Price Alerts Logout Loans up to 50 LAKHS Fixed Deposits Credit Cards Lifetime Free Credit Score Chat with Us Download App Follow us on: Go Ad-Free My Alerts mcmarketstockprice->Moneycontrol/MC_Market/MC_Market_StockPrice_728x90|~|Moneycontrol/MC_Market/MC_Market_StockPrice_300x250|~|Moneycontrol/MC_Market/MC_Market_StockPrice_728x90_2|~|Moneycontrol/MC_Market/MC_Market_StockPrice_728x90_1|~|Moneycontrol/MC_Market/MC_Market_StockPrice_300x250_2|~|Moneycontrol/MC_Market/MC_Market_StockPrice_300x250_1|~|Moneycontrol/MC_Market/MC_Market_StockPrice_300x250_BTF|~|Moneycontrol/MC_PriceChart/MC_PriceChart_300x250_ATF|~|Moneycontrol/MC_PriceChart/MC_PriceChart_728x90_ATF|~|Moneycontrol/MC_PriceChart/MC_PriceChart_728x90_BTF|~|Moneycontrol/MC_Market/MC_Market_StockPrice_300x250/MC_Market_StockPrice_Notices_300x250_ATF|~|Moneycontrol/MC_Market/MC_Market_StockPrice_QuartResult_728x90|~|Moneycontrol/MC_Market/MC_Market_StockPrice_CapitalStruc_728x90|~|Moneycontrol/MC_Market/MC_Market_StockPrice_PriceChart_728x90|~|Moneycontrol/MC_Market/MC_Market_StockPrice_History_300x600_ATF|~|Moneycontrol/MC_PriceChart/MC_PriceChart_300x250_ATF_1|~|Moneycontrol/MC_PriceChart/MC_PriceChart_728x90_ATF_1|~|Moneycontrol/MC_PriceChart/MC_PriceChart_300x250_MTF-> Go PRO Now PRO PRO Markets HOME INDIAN INDICES STOCK ACTION All Stats Top Gainers Top Losers Only Buyers Only Sellers 52 Week High 52 Week Low Price Shockers Volume Shockers Most Active Stocks GLOBAL MARKETS ETFs US MARKETS UNLISTED SHARES STOCK SCANNER Fundamental Scanner Technical Scanner ECONOMIC INDICATORS ECONOMIC CALENDAR MARKET ACTION F&O FII & DII Activity Corporate Action EARNINGS DEALS Bulk Deals Block Deals Intraday Large Deals SECTOR ANALYSIS PRE MARKET SEASONALITY ANALYSIS RESEARCH Investment Advice Technicals COMMODITY CURRENCY CRYPTOCURRENCY TECHNICAL TRENDS IPO BONDS WEBINAR SWING TRADING MASTERCLASS MC LEARN TRADERS CONCLAVE INTERVIEW SERIES OTHERS Cryptocurrency News Tools News LATEST NEWS Assembly Elections BUSINESS Economy Companies Mutual Funds Personal Finance IPO Startup Real Estate Bank Holidays 2025 Banking NATION & WORLD India City World Politics MARKETS Stocks Technical Analysis Equity Research Commodities Currency Gold Rate Silver Rate AQI SPECIAL Trends Opinion Explainers MC Buzz MC Features MC Learn TECHNOLOGY Personal Tech Auto Fintech MEDIA Podcast Photos Videos Web Stories CRYPTO DASHBOARD PETROL PRICE IN INDIA DIESEL PRICE IN INDIA MONSOON TRACKER OTHERS Entertainment Sports Lifestyle Health and Fitness Education Jobs Science Astro Religion Travel Editors Picks Tech India Learning Curve Portfolio Watchlist Commodities MF EXPLORE Home Find Fund Top Ranked Funds Performance Tracker SIP Performance Tracker ETFs NFO Top Performing Categories Learn TOOLS Returns Calculator Lumpsum SIP Balancer Delay Cost Calculator MF FORUM TRACK Your MF Investment MF Prices Personal Finance EXPLORE Home Investing Insurance Banking Financial Planning Property Tools Video Ask Expert Explainer NPS FIXED DEPOSIT FDs @ 8.4% p.a. Fixed Deposit Comparison Fixed Deposit Interest Calculator Corporate Deposits TAX Income tax Filing Guide Income Tax Calculator LTCG Tax on Property BANK HOLIDAYS 2025 LOANS & CREDIT CARDS Loans Loans up to 50 LAKHS Pick your Loan Amount 50K Personal Loan 1L Personal Loan 2L Personal Loan 5L Personal Loan 10L', 'images': [], 'rank': 1}, {'url': 'https://tickjournal.com/stock-screener/asian-paints-ltd/financial-statements/', 'content': '[no text]', 'images': [], 'rank': 2}, {'url': 'https://www.wsj.com/market-data/quotes/IN/XNSE/ASIANPAINT/financials', 'content': \"Skip to Main Content The Wall Street Journal English Edition Edition Use Alt + Down Arrow to expand. English (Chinese) (Japanese) Print Edition Video Audio Latest Headlines More More Other Products from WSJ Buy Side from WSJ The Journal Collection WSJ Shop WSJ Wine Latest World Business U.S. Politics Economy Tech Markets & Finance Opinion Arts Lifestyle Real Estate Personal Finance Health Style Sports The Wall Street Journal English Edition Edition Use Alt + Down Arrow to expand. English (Chinese) (Japanese) Print Edition Video Audio Latest Headlines More More Other Products from WSJ Buy Side from WSJ The Journal Collection WSJ Shop WSJ Wine Latest World Business U.S. Politics Economy Tech Markets & Finance Opinion Arts Lifestyle Real Estate Personal Finance Health Style Sports 404 Page Not Found We cant find the page you're looking for. If you typed the URL into your browser, check that you entered it correctly. If you reached this page via our site or search, please let us know by emailing support@wsj.com POPULAR ARTICLES Putin Tells U.S. Hell Halt War in Exchange for Eastern Ukraine The Influencer Driving Nantucket Crazy This Summer Why the Far Right Hates Churchill LATEST PODCASTS View All Whats News in Markets: Apples Investment, Fannie and Freddies IPO, Crocs Misstep Whats News in Markets: Apples Investment, Fannie and Freddies IPO, Crocs Misstep Donald Trump's Order Targeting 'Debanking'\", 'images': [], 'rank': 3}, {'url': 'https://www.smart-investing.in/mainFinancials.php?Company=ASIAN+PAINTS+LTD', 'content': '[BOM: 500820|NSE : ASIANPAINT] ASIAN PAINTS Financial Statement Analysis-Aug 09,2025 Browse Search Stocks Stock Analytics Annual Financials Quarterly Financials P/E (Price/Earnings) ratio P/B (Price/Book) ratio P/S (Price/Sales) ratio BSE & NSE Indices Top Gainers & Losers Top Companies by Industry Top Companies by Sector Pricing Tools Screener Compare Financial Ratios Income Statements Balance Sheets Cashflow Statements Shareholding Pattern Learn Video Courses Stock Market Investing Simplified Value Investing - The Ultimate Guide Technical Analysis - The Ultimate Guide Mutual Funds Investing Simplified Excel for Finance About About Us Contact Us LOGIN > x TOOLS Screener Compare RESEARCH Stock Analytics Financial Summary Financial Ratios Income Statement Balance Sheet Cashflow Statement Shareholding Pattern Quarterly Results Price/Earnings(PE) Ratio Price/Book(PB) Ratio Price/Sales(PS) Ratio LEARN Stock Market Investing Value Investing Technical Analysis Mutual Funds Investing Excel for Finance Home > Annual Financials > ASIAN PAINTS Search Limits / month This is the monthly limit on the various pages on our platform as per your subscription. See Pricing 1 count = 1 stock search , 1 screener search, 2 stock comparison If you search same stock multiple times, it would add to the count of total searches done. This count will be reset on 1st of every month at 12 am IST. Limits per month PRO PLUS STARTER BASIC (FREE) Stock Analytics Searches UNLIMITED 500 200 20 Stock Data Searches UNLIMITED 500 200 20 Stock Comparison Searches UNLIMITED 250 100 10 Stock Screener Searches UNLIMITED 20 10 3 Max Results per Screener 50 20 10 10 Access to Screeners ALL Limited Minimal Minimal See More Details ASIAN PAINTS Financial Statement Analysis [BOM: 500820|NSE : ASIANPAINT] The Revenues of ASIAN PAINTS have decreased by -4.48% YoY . The Earnings Per Share (EPS) of ASIAN PAINTS has decreased by -32.84 % YoY . REVENUES OPERATING MARGIN PROFIT AFTER TAX EPS ROCE ASIAN PAINTS Last 5 Annual Financial Results [BOM: 500820|NSE : ASIANPAINT] Consolidated Mar2025 Mar2024 Mar2023 Mar2022 Mar2021 Revenues 33,906 Cr 35,495 Cr 34,489 Cr 29,101 Cr 21,713 Cr Expenses 27,899 Cr 27,910 Cr 28,229 Cr 24,298 Cr 16,857 Cr Operating Profit (Excl OI) 6,006 Cr 7,585 Cr 6,260 Cr 4,804 Cr 4,856 Cr Other Income 573 Cr 688 Cr 386 Cr 380 Cr 303 Cr Interest 227 Cr 205 Cr 144 Cr 95 Cr 92 Cr Depreciation 1,026 Cr 853 Cr 858 Cr 816 Cr 791 Cr Profit Before Tax 5,103 Cr 7,348 Cr 5,689 Cr 4,188 Cr 4,304 Cr Profit After Tax 3,710 Cr 5,558 Cr 4,195 Cr 3,085 Cr 3,207 Cr Consolidated Net Profit 3,667 Cr 5,460 Cr 4,106 Cr 3,031 Cr 3,139 Cr Earnings Per Share (Rs) 38.23 56.92 42.81 31.59 32.73 PAT Margin (%) 8.85 12.97 10.21 8.97 12.60 ROE(%) 19.51 32.08 28.19 23.19 27.96 ROCE(%) 26.58 41.05 36.98 30.88 37.19 Total Debt/Equity(x) 0.04 0.06 0.06 0.06 0.03 Key Financials Market Cap : 237,440.4 Cr Revenue (TTM) : 33,874.4 Cr Net Profit(TTM) : 3,499.7 Cr EPS (TTM) : 36.5 P/E (TTM) : 67.8 Industry Peers & Returns 1W 1M 1Y ASIAN PAINTS 1.1% 1% -19.2% BERGER PAINTS INDIA -3.8% -5.1% 2.2% KANSAI NEROLAC PAINTS -4.4% -6.3% -21.9% AKZO NOBEL INDIA -2.1% 1.3% 13.1% INDIGO PAINTS -3.1% -3.6% -18% SHALIMAR PAINTS -4.2% -23.1% -48.8% What is the Fundamental Analysis of ASIAN PAINTS ? ASIAN PAINTS Revenues [BOM: 500820|NSE : ASIANPAINT] Y-o-Y -4.48 % 5 Yr CAGR 11.79 % Years Revenues % Change Mar2025 33,906 Cr -4.48 Mar2024 35,495 Cr 2.92 Mar2023 34,489 Cr 18.51 Mar2022 29,101 Cr 34.03 Mar2021 21,713 Cr - What is the Valuation of ASIAN PAINTS ? ASIAN PAINTS Operating Profit [BOM: 500820|NSE : ASIANPAINT] Y-o-Y -20.81 % 5 Yr CAGR 5.46 % Years Operating Profit % Change Mar2025 6,006 Cr -20.81 Mar2024 7,585 Cr 21.17 Mar2023 6,260 Cr 30.32 Mar2022 4,804 Cr -1.07 Mar2021 4,856 Cr - Operating Margins Y-o-Y -17.13 % 5 Yr CAGR -5.66 % Years Operating Margin% % Change Mar2025 17.71% -17.13 Mar2024 21.37% 17.74 Mar2023 18.15% 9.93 Mar2022 16.51% -26.16 Mar2021 22.36% - ASIAN PAINTS Profit After', 'images': [{'url': 'https://www.smart-investing.in/images/Marketing/Smart-Investing_Intro.png', 'alt_text': 'Smart-Investing', 'class': 'img-fluid', 'confidence': 0.7}, {'url': 'https://www.smart-investing.in/images/video_course/value-investing-video-course.png', 'alt_text': 'Value Investing Bootcamp', 'title': 'Value Investing Bootcamp', 'width': '350px', 'class': 'img-fluid', 'loading': 'lazy', 'confidence': 0.7}, {'url': 'https://www.smart-investing.in/images/video_course/technical-analysis-video-course.png', 'alt_text': 'Technical Analysis Masterclass', 'title': 'Technical Analysis Masterclass', 'width': '350px', 'class': 'img-fluid', 'loading': 'lazy', 'confidence': 0.7}, {'url': 'https://www.smart-investing.in/images/video_course/MutualFunds-Investing-Simplified-Video-Course.png', 'alt_text': 'Mutual Funds Investing Simplified', 'title': 'Mutual Funds Investing Simplified', 'width': '350px', 'class': 'img-fluid', 'loading': 'lazy', 'confidence': 0.7}], 'rank': 4}, {'url': 'https://stockanalysis.com/quote/nse/ASIANPAINT/financials/ratios/', 'content': \"Asian Paints (NSE:ASIANPAINT) Financial Ratios and Metrics Skip to main content Log In Sign Up Home Stocks Stock Screener Stock Exchanges Comparison Tool Earnings Calendar By Industry Stock Lists Top Analysts Top Stocks Corporate Actions IPOs Recent IPOs IPO Calendar IPO Statistics IPO News IPO Screener ETFs ETF Screener Comparison Tool New Launches ETF Providers News Trending Articles Technical Chart Market Movers Top Gainers Top Losers Most Active Premarket After Hours Market Heatmap Market Newsletter Stock Analysis Pro Watchlist Collapse Asian Paints Limited (NSE:ASIANPAINT) India Delayed Price Currency is INR 2,475.60 -30.90 (-1.23%) Aug 8, 2025, 3:30 PM IST Overview Financials Statistics Dividends History Profile Chart Income Balance Sheet Cash Flow Ratios Annual Quarterly TTM AMK Ratios and Metrics Market cap in millions INR. Fiscal year is April - March. Millions INR. Fiscal year is Apr - Mar. Current Mil Millions Data Data Source Download Full Width Fiscal Year Current FY 2025 FY 2024 FY 2023 FY 2022 FY 2021 2017 - 2021 Period Ending Aug '25 Aug 8, 2025 Mar '25 Mar 31, 2025 Mar '24 Mar 31, 2024 Mar '23 Mar 31, 2023 Mar '22 Mar 31, 2022 Mar '21 Mar 31, 2021 2017 - 2021 Market Capitalization 2,374,590 2,245,146 2,730,596 2,648,969 2,954,281 2,433,868 Upgrade Market Cap Growth -19.74% -17.78% 3.08% -10.33% 21.38% 52.26% Upgrade Enterprise Value 2,357,164 2,248,587 2,720,035 2,646,482 2,937,249 2,423,015 Upgrade Last Close Price 2475.60 2319.25 2788.91 2682.96 2970.76 2432.52 Upgrade PE Ratio 65.98 61.22 50.01 64.51 97.48 77.53 Upgrade Forward PE 55.71 53.55 53.39 56.64 81.35 56.61 Upgrade PS Ratio 7.02 6.63 7.71 7.69 10.19 11.32 Upgrade PB Ratio 11.84 11.19 14.06 16.11 20.81 18.40 Upgrade P/TBV Ratio 12.62 11.94 15.27 17.01 22.08 19.84 Upgrade P/FCF Ratio - 85.74 69.93 90.72 659.07 71.55 Upgrade P/OCF Ratio - 50.75 44.74 63.17 299.47 66.08 Upgrade PEG Ratio 5.33 23.86 3.48 3.03 4.06 3.14 Upgrade EV/Sales Ratio 6.97 6.64 7.68 7.69 10.14 11.27 Upgrade EV/EBITDA Ratio 39.19 40.13 37.61 43.96 64.72 52.52 Upgrade EV/EBIT Ratio 47.35 45.15 40.34 48.44 73.67 59.62 Upgrade EV/FCF Ratio - 85.87 69.66 90.63 655.27 71.23 Upgrade Debt / Equity Ratio 0.11 0.11 0.13 0.12 0.11 0.08 Upgrade Debt / EBITDA Ratio 0.39 0.38 0.33 0.31 0.33 0.23 Upgrade Debt / FCF Ratio - 0.88 0.63 0.66 3.54 0.32 Upgrade Asset Turnover - 1.12 1.27 1.41 1.34 1.18 Upgrade Inventory Turnover - 3.12 3.34 3.45 3.71 3.40 Upgrade Quick Ratio - 1.16 1.27 1.23 1.11 1.29 Upgrade Current Ratio - 2.09 2.06 2.09 2.00 2.03 Upgrade Return on Equity (ROE) - 18.79% 30.99% 27.38% 22.49% 26.99% Upgrade Return on Assets (ROA) - 10.32% 15.13% 14.00% 11.50% 13.91% Upgrade Return on Capital (ROIC) 13.67% 14.07% 20.93% 19.99% 16.55% 19.56% Upgrade Return on Capital Employed (ROCE) - 22.40% 31.50% 30.50% 25.90% 28.10% Upgrade Earnings Yield 1.51% 1.63% 2.00% 1.55% 1.03% 1.29% Upgrade FCF Yield - 1.17% 1.43% 1.10% 0.15% 1.40% Upgrade Dividend Yield 0.99% 1.07% 1.19% 0.96% 0.65% 0.73% Upgrade Payout Ratio - 85.63% 46.72% 47.15% 57.45% 15.91% Upgrade Buyback Yield / Dilution 0.02% 0.01% -0.01% 0.02% 0.01% - Upgrade Total Shareholder Return 1.01% 1.08% 1.19% 0.97% 0.66% 0.73% Upgrade Updated Feb 4, 2025. Source: S&P Global Market Intelligence. Standard template. Financial Sources. Sections Stocks IPOs ETFs Blog Services Stock Analysis Pro Free Newsletter Get Support Install The App Website Login Create Account Changelog Sitemap Advertise FAQ Company About Contact Us Terms of Use Privacy Policy Data Disclaimer Affiliate Program Market Newsletter Daily market news in bullet point format. Subscribe Site Theme Light Dark 2025 StockAnalysis.com. All rights reserved.\", 'images': [], 'rank': 5}, {'url': 'https://groww.in/stocks/asian-paints-ltd/company-financial', 'content': '[not extracted] Content limit reached', 'rank': 6}, {'url': 'https://www.etmoney.com/stocks/asian-paints-ltd/financials/944', 'content': '[not extracted] Content limit reached', 'rank': 7}, {'url': 'https://www.globaldata.com/company-profile/asian-paints-ltd/financials/', 'content': '[not extracted] Content limit reached', 'rank': 8}]",
            "annotations": null
          }
        ]
      },
      "T003": {
        "data": [
          {
            "type": "text",
            "text": "[{'url': 'https://www.latterly.org/asian-paints-competitors/', 'content': 'Top Asian Paints Competitors and Alternatives in 2025 Latterly.org Skip to content Contact About Menu Menu Business Marketing Marketing Strategies Technology Life Style Tips and Guides Top Asian Paints Competitors and Alternatives in 2025 As one of Asias largest paint manufacturers, Asian Paints has proven itself as a key player in the global paint industry since its inception in 1942. The company, headquartered in Mumbai, India, offers a wide range of decorative and industrial paints that cater to diverse clients across both residential and commercial sectors. However, the competitive landscape is ever-evolving, requiring a thorough paint industry analysis to understand the various Asian Paints competitors and their market positions. In 2024, notable companies including Berger Paints, Kansai Nerolac Paints, Akzo Nobel India, and Nippon Paint are challenging Asian Paints dominance, each contributing unique product offerings and innovations that impact the overall market comparison. This article provides insight into these leading alternatives as they navigate the dynamic paint market. Key Takeaways Asian Paints is a prominent player in the paint industry, founded in 1942. Berger Paints, founded in 1923, is the second-largest decorative paint company in India. Kansai Nerolac, established in 1920, focuses on automotive and powder coating paints. Akzo Nobel India, known for its diverse coatings, has been operational since 1911. Nippon Paint offers a significant global presence, dating back to 1881. Indigo Paints highlights innovation within the decorative segment since its establishment in 2000. Market trends for 2024 indicate a growing emphasis on sustainability and innovative technologies in the paint industry. Overview of Asian Paints Asian Paints, founded in 1942, has established itself as a prominent paint market leader. The company profile reveals a remarkable journey from its inception to becoming a key player in the Indian paint industry by 1967. Asian Paints currently holds a significant market share of 53%, translating to a revenue of approximately 34,875 crores INR within a valued market of 620 billion INR. Its success is attributed to a well-structured distribution network that integrates dealers, retailers, and service providers, effectively catering to both urban and rural markets across India and beyond. With a diverse product portfolio of over 2200 shades, Asian Paints offers solutions that withstand harsh weather conditions, coupled with warranties extending up to 10 years. The company has proficiently adapted its operational strategies to meet market changes, notably during the COVID-19 pandemic when it shifted to a direct supply model from factories to ensure smooth distribution to Tier 2 and 3 cities. The Asian Paints overview highlights its commitment to sustainability and innovation, evident through campaigns like Beautiful Homes and ColourNext, which not only engage customers but also showcase industry expertise. Their aggressive marketing, leveraging both traditional and digital platforms, has been instrumental in maintaining its reputation and engaging an audience that visited their website over 5.8 million times in September 2023. Financially, Asian Paints reported a revenue of 36,183 crore (US$4.3 billion) in 2024, further solidifying its status as a paint market leader. The operational efficiency is reflected in its impressive operating income of 7,215 crore (US$860 million) and a net income of 5,558 crore (US$670 million) during the same year. The Importance of Competitive Analysis in the Paint Industry In the evolving landscape of the paint industry competition, a thorough competitive analysis remains vital for companies aiming to maintain a strong market presence. As the consumer preferences shift rapidly in 2024, understanding market dynamics becomes imperative for brands like Asian Paints. This approach highlights strengths, weaknesses, opportunities, and threats (SWOT) within the market. Asian P', 'images': [], 'rank': 1}, {'url': 'https://www.mordorintelligence.com/industry-reports/india-paints-and-coatings-market', 'content': \"Paint Industry in India Size, Share & Market Analysis Reports Aerospace & Defense Agriculture Animal Nutrition & Wellness Automotive Chemicals & Materials Consumer Goods and Services Energy & Power Financial Services and Investment Intelligence Food & Beverage Healthcare Home and Property Improvement Hospitality and Tourism Logistics Manufacturing Products and Services Packaging Professional and Commercial Services Real Estate and Construction Retail Technology, Media and Telecom Custom Research About Our Team Our Clients Our Partners Social Responsibility Awards & Recognition FAQs Subscription Careers Contact +1 617-765-2493 Paint Industry in India Size & Share Analysis - Growth Trends & Forecasts (2025 - 2030) The India Paint Industry market report segments the industry into Technology (Water-borne Coatings, Solvent-borne Coatings, Powder Coatings, Radiation Cured Coatings), Resin Type (Acrylic, Alkyd, Polyurethane, Epoxy, Polyester, Other Resin Types (Vinyl, Latex)), and End-User Industry (Architectural, Automotive, Wood, Protective Coatings, General Industrial, Transportation, Packaging). Home Market Analysis Chemicals & Materials Research Paints and Coatings Research India Paints & Coatings Market About This Report Market Snapshot Market Analysis Key Market Trends Segment Analysis Competitive Landscape Major Players Industry Developments Table of Contents SCOPE OF THE REPORT Frequently Asked Questions Download PDF India Paints And Coatings Market Size Market Overview Study Period 2019 - 2030 Base Year For Estimation 2024 Forecast Data Period 2025 - 2030 Market Size (2025) USD 10.46 Billion Market Size (2030) USD 16.37 Billion Growth Rate (2025 - 2030) 9.38% CAGR Market Concentration High Major Players *Disclaimer: Major Players sorted in no particular order Image Mordor Intelligence. Reuse requires attribution under CC BY 4.0. Image Mordor Intelligence. Reuse requires attribution under CC BY 4.0. View Global Report Select Another Geography Asia Bahrain Egypt Europe Iran Iraq Latin America Middle East Middle East Middle East and Africa Morocco North America Oman Pakistan Qatar Saudi Arabia South America South East Asia Sri Lanka United Arab Emirates United States India Paints And Coatings Market Analysis The India Paints And Coatings Market size is estimated at USD 10.46 billion in 2025, and is expected to reach USD 16.37 billion by 2030, at a CAGR of 9.38% during the forecast period (2025-2030). The Indian paints and coatings industry is experiencing robust growth driven by extensive infrastructure development and urbanization initiatives. The construction sector has witnessed significant foreign direct investment inflows, reaching USD 26.24 billion in the construction development sector between April 2000 and September 2022. The government's ambitious Smart City Mission targeting 100 cities and various infrastructure development programs have created substantial demand for architectural coatings. These initiatives, coupled with the rising urban population and increasing disposable income, have fundamentally transformed the market landscape. The manufacturing sector's evolution has created new opportunities for industrial coatings applications. According to the Indian Brand Equity Foundation (IBEF), India has established itself as a major manufacturing hub, with the country possessing the fourth-largest rail network globally, spanning over 67,368 km of railway tracks. The expansion of manufacturing facilities, particularly in sectors like electronics, railways, and industrial equipment, has led to increased demand for specialized industrial coatings. This industrial growth has prompted coating manufacturers to develop innovative solutions that meet specific performance requirements while complying with environmental regulations. Technological advancements and sustainability initiatives are reshaping the industry landscape. The electric vehicle (EV) sector, according to the India Energy Storage Alliance (IESA), is projec\", 'images': [{'url': 'https://s3.mordorintelligence.com/india-paints-and-coatings-market/india-paints-and-coatings-market-size-image-1735449196191.webp', 'alt_text': 'India Paints And Coatings Market Summary', 'width': '300', 'height': '390', 'class': 'rd-img market-size-graph', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://s3.mordorintelligence.com/india-paints-and-coatings-market/india-paints-and-coatings-market-India-Paints-and-Coatings-Market-Market-Share-by-Resin-Type-Segment-2024-1737052102564.webp', 'alt_text': 'Market Analysis of India Paints And Coatings Market: Chart for Resin Type', 'width': '730', 'height': '360', 'class': 'full-width', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://s3.mordorintelligence.com/india-paints-and-coatings-market/india-paints-and-coatings-market_1707463136162_Paint_Industry_in_India_-_Market_Concentration.webp', 'alt_text': 'Paint Industry in India Concentration', 'width': '355', 'height': '318', 'class': 'full-width', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://s3.mordorintelligence.com/india-paints-and-coatings-market/india-paints-and-coatings-market_1707461860176_Paint_Industry_in_India_-_Key_Players.webp', 'alt_text': 'Major players in India Paints And Coatings industry', 'width': '250', 'height': '141', 'class': 'embed-code-context market-players rd-img', 'loading': 'lazy', 'confidence': 0.7}, {'url': 'https://www.mordorintelligence.com/express-img/success_img.png', 'alt_text': 'sucess-icon', 'class': 'success-image full-width', 'loading': 'lazy', 'confidence': 0.7}], 'rank': 2}, {'url': 'https://www.marketing91.com/asian-paints-competitors/', 'content': 'Top 30 Asian Paints Alternatives & Competitors in 2025 Marketing91 Home Discounts and Coupons Marketing Tools Discounts Financial Tools Discounts Brands Analysis Competitors Top Brands Lists SWOT of Brands Brand Ownership Home Competitors Top 30 Asian Paints Competitors & Alternatives in 2024 Top 30 Asian Paints Competitors & Alternatives in 2025 December 2, 2024 | By Hitesh Bhasin | Filed Under: Competitors Asian Paints is a leading paint and coatings company based in India that has established itself as a household name in the construction and home decor industry. In this article, we discuss the top Asian Paints Competitors and Alternatives. Founded in 1942, the company has grown steadily over the years and has become one of the largest paint manufacturers in Asia. Asian Paints offers a wide range of decorative and industrial paints, as well as related products, catering to the needs of both residential and commercial customers. Renowned for its innovative and high-quality products, Asian Paints has transformed the paint industry with its diverse range of colorful, textured, and finished products, enabling customers to customize their spaces creatively. The company emphasizes sustainability by offering eco-friendly paints low in volatile organic compounds (VOCs), making them healthier and environmentally friendly. The brand, recognized for its durability and aesthetic appeal, has built a strong distribution network and customer-centric ethos, earning admiration for its dedication to transforming spaces into inspiring environments. Product Type: Paints, coatings, products related to home decor, bath fittings Industry: Manufacturing Founded Date: February 1, 1942 Founders: Champaklal Choksey, Chimanlal Choksi, Suryakant Dani, Arvind Vakil Headquarters: Mumbai, Maharashtra, India Area Served: Worldwide Current CEO: Amit Syngle Table of Contents Toggle The top Asian Paints competitors are 1. Berger Paints India 2. Kansai Nerolac Paints 3. Akzo Nobel India (AkzoNobel) 4. Nippon Paint 5. PPG Industries 6. Sherwin-Williams 7. Indigo Paints 8. Sirca Paints India 9. Shalimar Paints 10. Jotun Paints India (Jotun) 11. Caparol Paints India (Caparol) 12. Diamond Paints 13. Goodlass Nerolac 14. BASF Coatings 15. RPM International 16. Axalta Coating Systems 17. Benjamin Moore & Co. 18. Sika AG 19. Hempel Group 20. Masco Corporation 21. Valspar Corporation 22. Tikkurila 23. Beckers Group 24. Kwality Paints 25. Majestic Paints 26. Paints & Coatings India 27. Pragati Paints 28. Sterling Paints 29. Kansai Paints India 30. Dulux Paints The top Asian Paints competitors are 1. Berger Paints India Product Type: Paints Industry: Paints and Coatings Founded Date: 1923 Founders: Lewis Berger Headquarters: Kolkata, India Area Served: India and Nepal Current CEO: Abhijit Roy Berger Paints India is Indias second-largest decorative paint company, with a commendable market share and presence in India and across Asia. Its rich history traces back to 1923, symbolizing trust, reliability, and innovation. Bergers eco-friendly, customer-centric approach distinguishes it from other competitors. It offers an exhaustive range of products addressing every painting need, including interior, exterior, metal, and wood. 2. Kansai Nerolac Paints Product Type: Paints Industry: Paints and Coatings Founded Date: 1920 Founders: Katsujiro Iwai Headquarters: Mumbai, India Area Served: India and Nepal Current CEO: H. M. Bharuka Kansai Nerolac Paints is a stalwart in the industrial segment, dominating market shares in automotive and powder coating paints in India. With Japanese roots, its renowned for advanced technology products, mainly catering to industrial clients with high-quality, durable coatings. Their product portfolio embraces decorative and performance coating, underlining innovation. Also Read Top 17 Tata Motors Competitors & Alternatives in 2025 3. Akzo Nobel India (AkzoNobel) Product Type: Paints and Coatings Industry: Chemicals Founded Date: 1911 Founders: Bof', 'images': [{'url': 'https://www.marketing91.com/wp-content/uploads/2023/11/Berger-Paints-India.jpg', 'alt_text': 'Berger Paints India', 'width': '630', 'height': '360', 'class': 'aligncenter size-full wp-image-3650382', 'confidence': 0.8999999999999999}, {'url': 'https://www.marketing91.com/wp-content/uploads/2023/11/Kansai-Nerolac-Paints.jpg', 'alt_text': 'Kansai Nerolac Paints', 'width': '630', 'height': '360', 'class': 'aligncenter size-full wp-image-3650373', 'confidence': 0.8999999999999999}, {'url': 'https://www.marketing91.com/wp-content/uploads/2023/11/Akzo-Nobel-India-AkzoNobel.jpg', 'alt_text': 'Akzo Nobel India (AkzoNobel)', 'width': '630', 'height': '360', 'class': 'aligncenter size-full wp-image-3650380', 'confidence': 0.8999999999999999}, {'url': 'https://www.marketing91.com/wp-content/uploads/2023/11/Nippon-Paint.jpg', 'alt_text': 'Nippon Paint', 'width': '630', 'height': '360', 'class': 'aligncenter size-full wp-image-3650374', 'confidence': 0.8999999999999999}, {'url': 'https://www.marketing91.com/wp-content/uploads/2023/11/PPG-Industries.jpg', 'alt_text': 'PPG Industries', 'width': '630', 'height': '360', 'class': 'aligncenter size-full wp-image-3650375', 'confidence': 0.8999999999999999}], 'rank': 3}, {'url': 'https://civillane.com/market-share-of-paint-brands-in-india/', 'content': 'Market Share of Paint Brands in India 2025 | CivilLane Skip to content Facebook X YouTube Instagram Pinterest | Mumbai - 91720 73720 | 98197 18861 | 73043 13893 | | contact@civillane.com Home 3D Design Rs.15 Free Estimate Modular Kitchens Interiors Home Interiors Office Interiors Commercial Interiors True Cost Bath Redo Gallery Videos More Articles Webstories Materials Rate 1 BHK Interior Design 2 BHK Interior Design 3 BHK Interior Design Market Share of Paint Brands in India 2025 View Larger Image Introduction: The paints market in India is a dynamic and competitive industry, featuring key players that dominate the market share. As of 2023, Asian Paints stands as the market leader, holding a significant 59% share. Other major players include Berger Paints with 18%, Kansai Nerolac Paints with 15%, AkzoNobel (Dulux) with 7%, and various other players making up the remaining 1%. Market Share Breakdown (2023): Asian Paints: 59% Berger Paints: 18% Kansai Nerolac Paints: 15% AkzoNobel (Dulux): 7% Others: 1% Growth Prospects: The Indian paints market is poised for substantial growth, projected to achieve a Compound Annual Growth Rate (CAGR) of 9.38% from 2023 to 2028. This growth is attributed to factors such as increasing urbanization, rising disposable incomes, and a growing demand for both aesthetic and protective coatings. Segmentation: The decorative paints segment holds the lions share of the Indian paints market, constituting approximately 75% of the total market share. In contrast, the industrial paints segment accounts for the remaining 25%. Competitive Landscape: The Indian paints industry is anticipated to remain fiercely competitive, prompting key players to focus on strategies such as innovation, product differentiation, and market expansion. As the industry evolves, companies will likely explore new markets to sustain and augment their market positions. Disclaimer: Its essential to acknowledge that market share data can vary across different sources. The figures presented here are based on estimates derived from various industry reports. Stakeholders are encouraged to verify information from multiple sources for a comprehensive understanding of the market dynamics. By CivilLane | 2025-05-21T16:55:40+05:30 November 28th, 2023 | Categories: Building Materials | Tags: AkzoNobel (Dulux) , Asian Paints , Berger , Indian paints industry , Kansai Nerolac , Market Share of Paint Brands , Paint Brands In India | 0 Comments Share This Informative Post, Choose Your Platform! Facebook X LinkedIn WhatsApp Email Related Posts Top 9 Trends in Swimming Pool Tile Designs Gallery Top 9 Trends in Swimming Pool Tile Designs October 19th, 2023 | 1 Comment Large Format Tiles Outshining Marbles Gallery Large Format Tiles Outshining Marbles July 17th, 2023 | 0 Comments Top 5 Quartz Countertops Brands in India Gallery Top 5 Quartz Countertops Brands in India April 13th, 2023 | 0 Comments Top 5 Tile Adhesive Brands In India Gallery Top 5 Tile Adhesive Brands In India April 8th, 2023 | 0 Comments Leverage PLI to Save The Laminate Industry Gallery Leverage PLI to Save The Laminate Industry March 23rd, 2023 | 0 Comments Leave a comment Cancel reply 3D Interior Design Service FREE Estimate Book Your Interior Designer Web Stories Top 5 Door Lock Brands In India The Art of Feng Shui: Balancing Energy in Your Home Design Indian PVC Plastic Pipe Market Share Who Owns Ambuja Cement Top 5 Kitchen Countertops Options Categories 2D Interior Design 3D Interior Design Aluminium Window Apartments Bangalore 30 40 Plans Bathroom Building Materials Electrical Wiring False Ceiling Flooring Furniture Glass Partitions Granite Hindi Home Decor Home Interiors Home Renovation Interior Designer Interviews Italian Marble Modular Kitchen Office Design Painting Repair & Renovation Tips & Tricks Vastu Tips Wall Tiles Wallpaper Like us on Facebook CivilLane.com 2016 - 2025 | All Rights Reserved | Terms | About Us Facebook X YouTube Instagram Pinterest Page load link Top 5 D', 'images': [{'url': 'https://civillane.com/wp-content/uploads/2023/07/Large-Format-Tiles-why-they-are-a-better-option-than-Marble-or-Granites-500x383.jpg', 'alt_text': 'Large Format Tiles Outshining Marbles', 'width': '500', 'height': '383', 'confidence': 0.9999999999999999}, {'url': 'https://i0.wp.com/civillane.com/wp-content/uploads/2023/11/Market-Share-of-Paint-Brands-in-India.jpg?resize=1000%2C673&ssl=1', 'alt_text': 'Market Share of Paint Brands in India', 'width': '1000', 'height': '673', 'class': 'alignnone size-full wp-image-33301', 'confidence': 0.8999999999999999}, {'url': 'https://civillane.com/wp-content/uploads/2023/10/Top-9-Trends-in-Swimming-Pool-Tile-Designsmain-500x383.jpg', 'alt_text': 'Top 9 Trends in Swimming Pool Tile Designs', 'width': '500', 'height': '383', 'confidence': 0.8999999999999999}, {'url': 'https://civillane.com/wp-content/uploads/2023/04/Top-5-Quartz-Countertops-Manufacturer-Brands-In-India-500x383.jpg', 'alt_text': 'Top 5 Quartz Countertops Brands in India', 'width': '500', 'height': '383', 'confidence': 0.8999999999999999}, {'url': 'https://civillane.com/wp-content/uploads/2023/04/Top-5-Tile-Adhesive-Brands-In-India-500x383.jpg', 'alt_text': 'Top 5 Tile Adhesive Brands In India', 'width': '500', 'height': '383', 'confidence': 0.8999999999999999}], 'rank': 4}, {'url': 'https://bstrategyhub.com/asian-paints-competitors-and-alternatives/', 'content': 'Top 10 Asian Paints Competitors and Alternatives | Business Strategy Hub Home Strategies Competitive Strategy Red Queen Effect Blue Ocean Strategy Only the paranoid survives Co-opetition Strategy Marketing Strategy Mintzbergs 5 Ps Ansoff Matrix BCG Matrix Target Right Customers Product Strategy Product Life Cycle Diffusion of Innovation Theory Bowmans Strategic Clock Pricing Strategies Organizational Strategy 7S Framework Porters Five Forces Strategy Diamond Value Innovation Strategy Tools PESTLE Analysis Gap Analysis SWOT Analysis Strategy Canvas Business Model SWOT Mission & Vision Competitors Ownership Search Home Strategies Competitive Strategy Red Queen Effect Blue Ocean Strategy Only the paranoid survives Co-opetition Strategy Marketing Strategy Mintzbergs 5 Ps Ansoff Matrix BCG Matrix Target Right Customers Product Strategy Product Life Cycle Diffusion of Innovation Theory Bowmans Strategic Clock Pricing Strategies Organizational Strategy 7S Framework Porters Five Forces Strategy Diamond Value Innovation Strategy Tools PESTLE Analysis Gap Analysis SWOT Analysis Strategy Canvas Business Model SWOT Mission & Vision Competitors Ownership Search Search Competitors Top 10 Asian Paints Competitors and Alternatives Brianna Parker February 6, 2025 Add comment 9 min read Asian Paints is a multinational paint company based in Mumbai, Maharashtra, India. Champaklal Choksey, Chimanlal Choksi, Suryakant Dani, and Arvind Vakil founded the company in 1942. A temporary ban on paint imports during WWII and the Quit India Movement created an opportunity for Asian Paints to conquer the Indian market. By 1967, the company was Indias leading paint manufacturer. Asian Paints seeks to transform itself into a complete home decor and lifestyle brand. In May 2023, Asian Paints unveiled a 17,000 sq ft home decor studio in Chennai. This location showcases lighting, furniture, fixtures, furnishings, and home designs. [ 1 ] Asian Paints diversified its product portfolio through strategic acquisitions, including Sleek Kitchens and Ess Ess bath fittings. As of August 2023, the company operated 44 Beautiful Home Studios in India. Asian Paints MD & CEO Amit Syngle plans to increase Beautiful Home Studios to 65-70 in FY24. This move can help the company boost the home decor share to 8-10% of decorative revenues. Asian Paints acquired a 49% stake in lighting specialist White Teak and a 51% stake in window and door manufacturer Weatherseal in 2022. In June 2023, the company raised its stake in White Teak by 11% to 60%. Both White Teak and Weatherseal will help Asian Paints hedge risk by grabbing more opportunities in lucrative segments before competitors. The company faces stiff competition from Berger, Kansai Nerolac, AkzoNobel, Nippon Paint, Shalimar, Jotun, Snowcem, Indigo, JSW, and Sirca. [ 2 ] Here is an in-depth analysis of Asian Paints competitors and alternatives: Table of Contents Toggle 1. Berger Paints 2. Kansai Nerolac Paints 3. AkzoNobel 4. Nippon Paint 5. Shalimar Paints 6. Jotun Paints 7. Snowcem Paints 8. Indigo Paints 9. JSW Paints 10. Sirca Paints India 1. Berger Paints Year founded: 1923 Headquarter: Kolkata, India Berger is Indias second-largest paint company after Asian Paints. It offers interior and exterior paints, waterproofing solutions, wood coatings, and other specialty products across several countries. In Q1 2023, Berger Paints Nepal underperformed due to country-specific issues, but Berger Paints India reported a 40% increase in net profit. [ 3 ] Berger has a strong distribution network with over 25,000 dealers across India. As of March 2023, the company controlled 19.4%-19.5% share of Indias paints market. The paint manufacturer seeks to increase its market share to 20% in 2023. The business expanded its presence in rural areas and invested in R&D and technology to improve its distribution system and create eco-friendly products. Berger is the top competitor for Asian Paints. [ 4 ] This World Soil Day, embrace the shades of s', 'images': [{'url': 'https://bstrategyhub.com/wp-content/uploads/2023/12/Asian-Paints-Competitors-and-Alternatives-Featured-Image-by-Roselyn-Tirado.jpg', 'alt_text': 'Asian Paints Competitors and Alternatives Featured Image by Roselyn Tirado', 'width': '750', 'height': '500', 'class': 'attachment-gridlove-cover size-gridlove-cover wp-post-image', 'confidence': 0.8999999999999999}, {'url': 'https://bstrategyhub.com/wp-content/uploads/2023/11/Gopuff-Competitors-and-Alternatives-Featured-Image-by-Rowan-Freeman.jpg', 'alt_text': 'Gopuff Competitors and Alternatives Featured Image by Rowan Freeman', 'width': '385', 'height': '274', 'class': 'attachment-gridlove-b8 size-gridlove-b8 wp-post-image', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://bstrategyhub.com/wp-content/uploads/2021/12/udemy-competitors-image-credit-lewis-keegan-unsplash.jpg', 'alt_text': 'Udemy Competitors Image Credit Lewis Keegan Unsplash.', 'width': '385', 'height': '257', 'class': 'attachment-gridlove-b8 size-gridlove-b8 wp-post-image', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://bstrategyhub.com/wp-content/uploads/2023/04/fiserv-competitors-and-alternatives-featured-image-by-firmbee.com_.jpg', 'alt_text': 'fiserv competitors and alternatives featured image by firmbee.com', 'width': '385', 'height': '256', 'class': 'attachment-gridlove-b8 size-gridlove-b8 wp-post-image', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://bstrategyhub.com/wp-content/uploads/2022/12/top-lego-competitors-alternatives-featured-image-by-xavi-cabrera.jpg', 'alt_text': 'Top Lego Competitors Alternatives Featured Image By Xavi Cabrera', 'width': '385', 'height': '257', 'class': 'attachment-gridlove-b8 size-gridlove-b8 wp-post-image', 'loading': 'lazy', 'confidence': 0.8999999999999999}], 'rank': 5}, {'url': 'https://tradebrains.in/features/grasim-vs-asian-paints-who-will-dominate-the-paint-industry/', 'content': '[not extracted] Content limit reached', 'rank': 6}, {'url': 'https://thebrandhopper.com/2023/02/26/painting-a-picture-of-rivals-top-10-competitors-of-asian-paints-in-india/', 'content': '[not extracted] Content limit reached', 'rank': 7}, {'url': 'https://prismaneconsulting.com/blog-details/asian-paints-market-share-decline-amid-rising-competition-akzonobel-considers-exiting-indian-paints-business', 'content': '[not extracted] Content limit reached', 'rank': 8}]",
            "annotations": null
          }
        ]
      },
      "T004": {
        "product_portfolio": [
          {
            "type": "text",
            "text": "[{'url': 'https://www.asianpaints.com/guides/paint-product-guide.html', 'content': 'Complete Paint Product Guide: Everything to Know - Asian Paints The Ultimate Guide to Mastering Paint Selection Colours Colour by family All Colours Grey Blue Brown Red Orange Yellow Green Purple Pink Whites Off Whites Colour Collections Royale Designer Colour of the year Colour Tools Home Colour Guide Wall Paint Finder Wood Paint Finder Wood Finish Visualiser Textures For You New Shade Cards New Inspirations Colour combinations Celebrity homes Products For Interior Walls Paints Textures Wallpapers For Exterior Walls Paints Textures Waterproofing All products Bathrooms Terrace & tanks Cracks & joints Interior Tiling Exteriors Other Surface Wood paints Metal paints Undercoats Adhesives Brushes & Ancillaries Shop DIY Tools Mechanized tools Colour books Royale play texture tool Services Painting Interior solutions Waterproofing Sleek Kitchen Bathroom design & execution Calculators Paint budget calculator Waterproofing budget calculator Interior design cost calculator Kitchen cost calculator Sustainability More Find Contractor Find a store Blogs Guides Paint bucket return Explore home decor Our Company Investors Careers Contact us Search for Get recommendations for Colour inspiration,Textures, Wallpapers, Interior Design ideas, etc... Drag & drop your image here or Browse an image Max file size limit is 5MB Only JPG, JPEG and PNG file formats are allowed Please upload only 1 file Oops file upload failed, please try again!!! Search with a photo Get recommendations for Colour inspiration,Textures, Wallpapers, Interior Design ideas, etc... Gallery - Choose an existing photo Camera - Click a photo Max file size limit is 5MB Oops file upload failed, please try again!!! Uploading... Find Contractor Store Profile Hello My Profile Wishlist Sign out Hello {{minicart.cartcount > 0 ? minicart.cartcount : 0}} Cart Processing... You have {{minicart.cartcount}} items {{item[\"totalPrice\"][\"value\"]}} - + Total Amount {{minicart.totalprice}} Checkout Your cart is empty Shop now Book Free Site Visit Colours Colour by family All Colours Grey Blue Brown Red Orange Yellow Green Purple Pink Whites Off Whites Colour Collections Royale Designer Colour of the year Colour Tools Home Colour Guide Wall Paint Finder Wood Paint Finder Wood Finish Visualiser Textures For You New Shade Cards New Inspirations Colour combinations Celebrity homes Products For Interior Walls Paints Textures Wallpapers For Exterior Walls Paints Textures Waterproofing All products Bathrooms Terrace & tanks Cracks & joints Interior Tiling Exteriors Other Surface Wood paints Metal paints Undercoats Adhesives Brushes & Ancillaries Shop DIY Tools Mechanized tools Colour books Royale play texture tool Services Painting Interior solutions Waterproofing Sleek Kitchen Bathroom design & execution Calculators Paint budget calculator Waterproofing budget calculator Interior design cost calculator Kitchen cost calculator Sustainability More... Find Contractor Find a store Blogs Guides Paint bucket return Explore home decor Our Company Investors Careers Contact us Book Free Site Visit Get recommendations for Colour inspiration,Textures, Wallpapers, Interior Design ideas, etc... Drag & drop your image here or Browse an image Max file size limit is 5MB Only JPG, JPEG and PNG file formats are allowed Please upload only 1 file Oops file upload failed, please try again!!! Search with a photo Get recommendations for Colour inspiration,Textures, Wallpapers, Interior Design ideas, etc... Gallery - Choose an existing photo Camera - Click a photo Max file size limit is 5MB Oops file upload failed, please try again!!! Uploading... The Ultimate Guide to Mastering Paint Selection Navigating Finishes, Properties, and More Selecting Paint According to Paint Types Selecting Paint According to Finishes Selecting Paint According to Properties Selecting Paint According to Climate & Surroundings Selecting Paint According to Rooms in Your Home Selecting Paint According to Budget How Can Asian Paints Help You With', 'images': [{'url': 'https://static.asianpaints.com/content/dam/apcolourcatalogue/splash-popup/mobile-home-decor-image.webp', 'alt_text': 'mobile-home-decor-image', 'width': '290', 'height': '260', 'loading': 'eager', 'confidence': 0.8999999999999999}, {'url': 'https://static.asianpaints.com/content/dam/apcolourcatalogue/splash-popup/mobile-paint-textures-image-40.webp', 'alt_text': 'mobile-paint-textures-image-40', 'width': '290', 'height': '260', 'loading': 'eager', 'confidence': 0.8999999999999999}, {'url': 'https://static.asianpaints.com/content/dam/apcolourcatalogue/asset/ap-revamp/design-guide/product-guide/sofa-for-living-room.png', 'alt_text': 'Living room sofa design - Asian Paints', 'title': 'Living room sofa design - Asian Paints', 'loading': 'eager', 'confidence': 0.7}, {'url': 'https://static.asianpaints.com/content/dam/apcolourcatalogue/asset/ap-revamp/design-guide/product-guide/paint-for-exterior.png', 'alt_text': 'Asian Paints | Selecting the Perfect Paint Guide - 2', 'title': 'Asian Paints | Selecting the Perfect Paint Guide - 2', 'loading': 'eager', 'confidence': 0.7}, {'url': 'https://static.asianpaints.com/content/dam/apcolourcatalogue/asset/ap-revamp/design-guide/product-guide/matte-paint-for-home.png', 'alt_text': 'Matte wall paint for home - Asian Paints', 'title': 'Matte wall paint for home - Asian Paints', 'loading': 'eager', 'confidence': 0.7}], 'rank': 1}, {'url': 'https://yespainter.com/asian-paints-product-list/', 'content': 'Asian Paints Product List Asian Paints Product List with Price- Painting service by Yes Painter Yes Painter Skip to content Home Products Asian Paints Interior Products Tractor Emulsion Premuim Emulsion Royale Luxury Emulsion Royale Matt Emulsion Royale Atmos Emulsion Royale Shyne Emulsion Royale Health Shield Royale Aspira Exterior Products Ace Sparc Emulsion Ace Exterior Emulsion Apex Exterior Emulsion Apex Ultima Exterior Emulsion Ultima Protek Exterior Emulsion Apex Ultima Protek Duralife Apex Tile Guard SmartCare Damp Sheath SmartCare Damp Proof Undercoats Trucare Interior Wall Primer Trucare Exterior Wall Primer Royale Base Coat Trucare Powder Wall Putty Trucare Acrylic Wall Putty Wood & Metal Apcolite Premium Enamel Apcolite Rust Shield WoodTech Melamyne WoodTech PU Pallete Berger Paint Interior Products Bison Acrylic Emulsion Commando Acrylic Paint Rangoli Total Care Emulsion Easy Clean Luxury Emulsionn Silk Glamor Luxury Emulsion Silk Breathe Easy Luxury Emulsion Silk Luxury Exterior Products Walmasta Antifungal Emulsion WeatherCoat All Guard WeatherCoat Anti Dust WeatherCoat Long Life 7 WeatherCoat Smooth WeatherCoat Glow WeatherCoat Champ WeatherCoat Long Life 10 Undercoats Bison Wall Putty Happy Wall Acrylic Putty WeatherCoat Exterior Primer BP Exterior Cement Primer BP White Interior Primer BP Interior Cement Primer Nerolac Paint Interior Products Beauty Smooth Emulsion Beauty Gold Emulsion Pearls Interior Emulsion Impressions 24 Carat Impressions Eco Clean Impressions Ideaz Pearls Lustre Finish Exterior Products Excel Anti Peel Emulsion Excel Mica Marble Excel Rain Guard Vertical Excel Rain Guard Horizontal Excel Tile Guard Excel Total All in One Suraksha Sheen Undercoats Cement Putty Wall Putty Acrylic Exterior Wall Primer Cement Primer Nippon Paint Interior Products Breeze Emulsion Vinilex Emulsion Atom 2 In 1 Spotless NXT Satin-Glo Aura Satin Glo+ Matex Ez Wash Matex Gold Exterior Products Shogun Emulsion Atom 2 In 1 Samurai Sumo Xtra Weatherond Advance Durafresh Xpert Weatherbond Pro Undercoats Wood Primer Exterior Wall Primer Interior Wall Primer Aqua Primer Walltron FR-Putty Indigo Paint Interior Products Bronze Interior Emulsion Acrylic Distemper Silver Acrylic Distemper Gold Silver Emulsion Series Bright Ceiling Coat Platinum Bright Ceiling Coat Gold Premium Emulsion Gold Sheen Emulsion Silver Luxury Interior Emulsion Exterior Products Gold Series Emulsion Premium XT Emulsion (Platinum Series) Dirtproof & Waterproof Laminate Undercoats ST Wood Primer Exterior Wall Primer Gold Series Water Thinnable Cement Primer Polymer Putty Silver Series Acrylic Wall Putty Gold Series Stencil Collection Kids Room Geometric Nature Inspired Magneto Border Ethnic All Over Interior Texture Special Effects Safari Infinitex Stucco Exterior Texture Visualiser Asian Paints Colours Berger Paint Colours Nippon Paint Colours Dulux Paint Colours Kansai Nerolac Colours Sherwin Williams Colours Services Interior Painting Exterior Painting Wood and Metal Texture Painting Touch-up Service Customised Decor Testimonials Projects Reviews Blogs Estimate Cost Home Products Asian Paints Interior Products Tractor Emulsion Premuim Emulsion Royale Luxury Emulsion Royale Matt Emulsion Royale Atmos Emulsion Royale Shyne Emulsion Royale Health Shield Royale Aspira Exterior Products Ace Sparc Emulsion Ace Exterior Emulsion Apex Exterior Emulsion Apex Ultima Exterior Emulsion Ultima Protek Exterior Emulsion Apex Ultima Protek Duralife Apex Tile Guard SmartCare Damp Sheath SmartCare Damp Proof Undercoats Trucare Interior Wall Primer Trucare Exterior Wall Primer Royale Base Coat Trucare Powder Wall Putty Trucare Acrylic Wall Putty Wood & Metal Apcolite Premium Enamel Apcolite Rust Shield WoodTech Melamyne WoodTech PU Pallete Berger Paint Interior Products Bison Acrylic Emulsion Commando Acrylic Paint Rangoli Total Care Emulsion Easy Clean Luxury Emulsionn Silk Glamor Luxury Emulsion Silk Breathe Easy Luxury Emulsion Silk Luxury Exterior Products Wa', 'images': [{'url': 'https://yespainter.com/wp-content/uploads/2021/04/Asian-Paints-Tractor-Emulsion-1-150x150.png', 'alt_text': 'Asian Paints Tractor Emulsion', 'width': '150', 'height': '150', 'class': 'img-responsive wp-image-5889', 'confidence': 0.7}, {'url': 'https://yespainter.com/wp-content/uploads/2021/04/Asian-Paints-Apcolite-Premium-Emulsion-150x150.png', 'alt_text': 'Asian-Paints-Apcolite-Premium-', 'width': '150', 'height': '150', 'class': 'img-responsive wp-image-5907', 'confidence': 0.7}, {'url': 'https://yespainter.com/wp-content/uploads/2021/05/Asian-paints-royal-luxury-150x150.png', 'alt_text': 'Asian paints royale luxury', 'width': '150', 'height': '150', 'class': 'img-responsive wp-image-6691', 'confidence': 0.7}, {'url': 'https://yespainter.com/wp-content/uploads/2021/05/Asian-Paints-Royale-Matt-150x150.png', 'alt_text': 'Asian-Paints-Royale-Matt', 'width': '150', 'height': '150', 'class': 'img-responsive wp-image-5939', 'confidence': 0.7}, {'url': 'https://yespainter.com/wp-content/uploads/2021/05/Asian-paints-Royale-Atmos111-150x150.png', 'alt_text': 'Asian-paints-Royale-Atmos', 'width': '150', 'height': '150', 'class': 'img-responsive wp-image-6792', 'confidence': 0.7}], 'rank': 2}, {'url': 'https://1pdf.in/asian-paints-products-list/', 'content': \"Asian Paints Products List with Price - 1PDF Asian Paints Products List with Price PDF General 0.43 MB / 12 Pages 0 likes like share this pdf Share DMCA / report this pdf Report Preview PDF Asian Paints Products List with Price Asian Paints offers a wide range of products across various categories including interior wall finishes, exterior wall finishes, metal finishes, wood finishes, undercoats, and more. Here is a comprehensive list of some of the key products offered by Asian Paints: Asian Paints All Products List Interior Wall Finishes Royale Atmos Royale Aspira Royale Luxury Emulsion Royale Shyne Luxury Emulsion Royale Matt Royale Health Shield Royale Play (special effects range) Tractor Emulsion Tractor Emulsion Shyne Apcolite Premium Emulsion Apcolite Advanced Emulsion Exterior Wall Finishes Apex Ultima Apex Ultima Protek Apex Ultima Protek Duralife Apex Weatherproof Emulsion Apex Shyne Apex Advanced Ace Exterior Emulsion Metal Finishes Apcolite Premium Gloss Enamel Apcolite Premium Satin Enamel Apcolite Advanced Gloss Enamel Apcolite Advanced Satin Enamel Asian Paints Woodtech PU Wood Finishes Woodtech PU (Polyurethane) Woodtech Melamyne Woodtech Touchwood Interior Woodtech Emporio PU Woodtech Aquadur PU Undercoats Trucare Interior Wall Primer Trucare Exterior Wall Primer Trucare Premium Wall Putty Trucare Exterior Wall Putty Trucare Acrylic Wall Putty Trucare Exterior P8rimer Trucare Interior Wall Primer (Water Thinnable) Apcolite Advanced Primer Waterproofing Solutions SmartCare Damp Proof SmartCare Damp Block 2K SmartCare Damp Sheath Exterior SmartCare Epoxy TriBlock SmartCare Tile Grout SmartCare Tile Adhesive SmartCare Crack Seal Designer Finishes Royale Play Metallics Royale Play Dune8 Royale Play Safari Royale Play Antico Royale Play Stucco Textures and Special Effects Royale Play Textures Royale Play Special Effects Royale Play Metallic Glaze Royale Play Glaze Others SmartCare Anti Termite Solution Trucare Wall Primer Cement Download Asian Paints Products List with Price PDF Free Download Recently Added PDF's Anandbazaar Patrika ( ) 70th National Film Awards Winners List OICL Assistant Recruitment 2025 Voter List 1995 West Bengal Voter List 2000 West Bengal Haryana CET Question Paper 2025 LBS Rank List 2025 TS Eamcet Web Options Colleges List Samras Hostel Merit List 2025 RGUKT Basar Selection Merit List 2025 PM Kisan 20th Installment Date List List of Indian Military Aircraft UP VDO Syllabus 2025 RSMSSB 4th Grade Syllabus Hindi 2025 DFCCIL Syllabus 2025 TNPSC Group 2 Syllabus 2025 1PDF or 1pdf.in does not claim to own any of the PDF contents including files and images of any formats, neither does it claims the accuracy of contents in the PDF files (PDF and Images). Read full disclaimer. 1PDF About Contact Privacy Policy copy url Welcome to 1PDF! Sign Up / Login Convert PDF to Images 1PDF Blog Categories Popular Topics About Contact Privacy Policy Disclaimer DMCA / Report Content\", 'images': [], 'rank': 3}, {'url': 'https://www.scribd.com/document/182832750/Asian-Paints-Products-details-docx', 'content': 'Asian Paints Products Details | PDF | Paint | Acrylic Paint Open navigation menu Close suggestions Search Search en Change Language Upload Sign in Sign in Download free for days 100% (3) 100% found this document useful (3 votes) 29K views 12 pages Asian Paints Products Details The document provides product specifications for various paints by Asian Paints. It includes details about the substrates, coverage in square feet per liter or kg, gloss/sheen, durability, a Full description Uploaded by abdulyunus_amir AI-enhanced title and description Download Save Save Asian Paints Products details.docx For Later Share 100% 100% found this document useful, undefined 0% , undefined Print Embed Report 100% (3) 100% found this document useful (3 votes) 29K views 12 pages Asian Paints Products Details The document provides product specifications for various paints by Asian Paints. It includes details about the substrates, coverage in square feet per liter or kg, gloss/sheen, durability, and application process for different product lines like Apex weatherproof emulsion, Royale Play special effects paint, Melamine clear finishes, PU interior and exterior clear coats, and others. Performance properties like scratch resistance, hardness, impact resistance, and non-yellowing properties are also mentioned. Read more Download 100% (3) 100% found this document useful (3 votes) 29K views 12 pages Asian Paints Products Details The document provides product specifications for various paints by Asian Paints. It includes details about the substrates, coverage in square feet per liter or kg, gloss/sheen, durability, a Full description Uploaded by abdulyunus_amir AI-enhanced title and description Carousel Previous Carousel Next Download Save Save Asian Paints Products details.docx For Later Share 100% 100% found this document useful, undefined 0% , undefined Print Embed Report Download Save Asian Paints Products details.docx For Later You are on page 1 / 12 Search Fullscreen Share this document Share on Facebook, opens a new window Share on LinkedIn, opens a new window Share with Email, opens mail client Copy link Millions of documents at your fingertips, ad-free Subscribe with a free trial Footer menu Back to top About About Scribd, Inc. Everand: Ebooks & Audiobooks SlideShare Join our team! Contact us Support Help / FAQ Accessibility Purchase help AdChoices Legal Terms Privacy Copyright Do not sell or share my personal information Social Instagram Instagram Facebook Facebook Pinterest Pinterest Get our free apps About About Scribd, Inc. Everand: Ebooks & Audiobooks SlideShare Join our team! Contact us Legal Terms Privacy Copyright Do not sell or share my personal information Support Help / FAQ Accessibility Purchase help AdChoices Social Instagram Instagram Facebook Facebook Pinterest Pinterest Get our free apps Documents Language : English Copyright 2025 Scribd Inc. We take content rights seriously. Learn more in our FAQs or report infringement here . We take content rights seriously. Learn more in our FAQs or report infringement here . Language : English Copyright 2025 Scribd Inc. 576648e32a3d8b82ca71961b7a986505', 'images': [], 'rank': 4}, {'url': 'https://gruhapraveshinteriors.com/all-asian-paints-products-list-price/', 'content': 'All Asian Paints Products List with Price Details-2023. - Gruha Pravesh Skip to content Gruha Pravesh Facebook Instagram Twitter Home Decor Kitchen Design a Room Designs Know Your Product Appliances Plywood Paints Home Improvement Planning Flooring Garden Vastu Furniture Resources About Us Contact Us Our Packages Blog Search Search for: Gruha Pravesh Search Search for: Menu Home Decor Kitchen Design a Room Designs Know Your Product Appliances Plywood Paints Home Improvement Planning Flooring Garden Vastu Furniture Resources About Us Contact Us Our Packages Blog Facebook Instagram Twitter Home Blog Paints All Asian Paints Products List with Price Details-2023. Paints 8 min read All Asian Paints Products List with Price Details-2023. admin 8 min read Updated On April 4, 2023 March 13, 2023 March 13, 2023 April 4, 2023 Write a Comment on All Asian Paints Products List with Price Details-2023. Want to know all Asian paints products list and their respective prices for various pack sizes with a detailed usage guide? Then Youve reached your destination. In this article, we are going to discuss Asian Paints price list for all its products like interior paints, exterior paints, Putty, primer, enamel paints, etc. with detailed product guides such as coverage, usage guide, shades, types, and all, so that you can select the one suits your requirement and budget. Asian Paints Logo Table of Contents Toggle About Asian Paints Asian Paints Price Asian Paints Products List & Price Details Asian Paints for interior walls Interior Wall Paints Asian Paints Royale Asian Paints Apcolite Asian Paints Tractor Interior Wall Textures Asian paints Royal Play Asian Paints for exterior walls Exterior Wall Paints Asian Paints Apex Ultima Asian Paints Apex Asian Paints Ace Exterior Wall Textures Asian Paints Apex Createx Asian Paints Ultima Allura Asian Paints Primer Asian Paints Wall Putty Asian Paints for wood Asian paints for Metal Asian Paints Rollers, Brushes & Ancillaries Asian Paints Wallpaper Conclusion About Asian Paints Asian Paints is one of the largest paint makers in the world. It was founded in 1942 and since then it has grown to become the largest paint manufactures in India. It has a presence in more than 60 countries and has over 60 manufacturing plants worldwide. Asian paints is a highly respected company in India due to its superior quality products, commitment, and innovation. It has been honored with multiple awards for its innovative products, ethical practices, and corporate governance policies. The company is a benchmark for many and often cited case studies in various business schools and management courses in India. Asian Paints Price Look, Asian Paints has a massive product line with various pack sizes, and its quite impossible for me to define all product prices for each pack size in a single article. So, we have to divide Asian paints products into various categories like Asian paints for interior, and exterior, Asian paints wall putty, Asian paints primer, Asian Paint Enamel, and many as it belongs to, and then define their prices for various pack sizes so that you can pick the product you want to know the price as mentioned below. Asian Paints Products List & Price Details The dominant paint brand has many types of paint products, from wall paint to wallpaper, from wood to metal, and from waterproofing solutions to adhesives. Below are the product categories of Asian Paints. Asian Paints for interior walls Asian Paints for exterior walls Asian Paints primer Asian Paints Putty Asian paints for wood Asian Paints for metal Asian Paints Brushes, rollers & Ancillaries Asian Paints wallpaper So, lets discuss all Asian paint products and their respective price list one by one. Asian Paints for interior walls Asian paints offer varieties of paints for interior walls like emulsion paints, acrylic emulsions, distempers, texture paints, etc. These paints are available in a wide range of colors, shades, and finishes. You can choose the o', 'images': [], 'rank': 5}, {'url': 'https://www.bccresearch.com/company-index/profile/asian-paints/products', 'content': '[not extracted] Content limit reached', 'rank': 6}, {'url': 'https://www.slideshare.net/Nirajkumar119/asian-paints-product-mix', 'content': '[not extracted] Content limit reached', 'rank': 7}, {'url': 'https://www.asianpaints.com/products.html', 'content': '[not extracted] Content limit reached', 'rank': 8}]",
            "annotations": null
          }
        ]
      }
    },
    "validation_results": {
      "is_valid": true,
      "is_dag": true,
      "cycles": [],
      "disconnected_components": [],
      "orphaned_nodes": [],
      "root_nodes": [],
      "leaf_nodes": [
        "T010"
      ],
      "warnings": [],
      "errors": []
    }
  },
  "nodes": [
    {
      "description": "Initial Query",
      "agent": "System",
      "status": "completed",
      "id": "ROOT"
    },
    {
      "id": "T001",
      "description": "Retrieve Asian Paints' company overview, history, and key milestones.",
      "agent": "RetrieverAgent",
      "agent_prompt": "Retrieve a comprehensive overview of Asian Paints, including its history, key milestones, and evolution as a company. Focus on its initial establishment, significant expansions, and transformative decisions that shaped its current market position. Also, detail its products and services.",
      "reads": [],
      "writes": [
        "T001"
      ],
      "status": "completed",
      "output": {
        "asian_paints_overview": [
          {
            "type": "text",
            "text": "[{'url': 'https://www.asianpaints.com/about-us.html', 'content': 'About Asian Paints - 75+ Years Of Innovation In Paints Asian Paints - About Us Colours Colour by family All Colours Grey Blue Brown Red Orange Yellow Green Purple Pink Whites Off Whites Colour Collections Royale Designer Colour of the year Colour Tools Home Colour Guide Wall Paint Finder Wood Paint Finder Wood Finish Visualiser Textures For You New Shade Cards New Inspirations Colour combinations Celebrity homes Products For Interior Walls Paints Textures Wallpapers For Exterior Walls Paints Textures Waterproofing All products Bathrooms Terrace & tanks Cracks & joints Interior Tiling Exteriors Other Surface Wood paints Metal paints Undercoats Adhesives Brushes & Ancillaries Shop DIY Tools Mechanized tools Colour books Royale play texture tool Services Painting Interior solutions Waterproofing Sleek Kitchen Bathroom design & execution Calculators Paint budget calculator Waterproofing budget calculator Interior design cost calculator Kitchen cost calculator Sustainability More Find Contractor Find a store Blogs Guides Paint bucket return Explore home decor Our Company Investors Careers Contact us Search for Get recommendations for Colour inspiration,Textures, Wallpapers, Interior Design ideas, etc... Drag & drop your image here or Browse an image Max file size limit is 5MB Only JPG, JPEG and PNG file formats are allowed Please upload only 1 file Oops file upload failed, please try again!!! Search with a photo Get recommendations for Colour inspiration,Textures, Wallpapers, Interior Design ideas, etc... Gallery - Choose an existing photo Camera - Click a photo Max file size limit is 5MB Oops file upload failed, please try again!!! Uploading... Find Contractor Store Profile Hello My Profile Wishlist Sign out Hello {{minicart.cartcount > 0 ? minicart.cartcount : 0}} Cart Processing... You have {{minicart.cartcount}} items {{item[\"totalPrice\"][\"value\"]}} - + Total Amount {{minicart.totalprice}} Checkout Your cart is empty Shop now Book Free Site Visit Colours Colour by family All Colours Grey Blue Brown Red Orange Yellow Green Purple Pink Whites Off Whites Colour Collections Royale Designer Colour of the year Colour Tools Home Colour Guide Wall Paint Finder Wood Paint Finder Wood Finish Visualiser Textures For You New Shade Cards New Inspirations Colour combinations Celebrity homes Products For Interior Walls Paints Textures Wallpapers For Exterior Walls Paints Textures Waterproofing All products Bathrooms Terrace & tanks Cracks & joints Interior Tiling Exteriors Other Surface Wood paints Metal paints Undercoats Adhesives Brushes & Ancillaries Shop DIY Tools Mechanized tools Colour books Royale play texture tool Services Painting Interior solutions Waterproofing Sleek Kitchen Bathroom design & execution Calculators Paint budget calculator Waterproofing budget calculator Interior design cost calculator Kitchen cost calculator Sustainability More... Find Contractor Find a store Blogs Guides Paint bucket return Explore home decor Our Company Investors Careers Contact us Book Free Site Visit Get recommendations for Colour inspiration,Textures, Wallpapers, Interior Design ideas, etc... Drag & drop your image here or Browse an image Max file size limit is 5MB Only JPG, JPEG and PNG file formats are allowed Please upload only 1 file Oops file upload failed, please try again!!! Search with a photo Get recommendations for Colour inspiration,Textures, Wallpapers, Interior Design ideas, etc... Gallery - Choose an existing photo Camera - Click a photo Max file size limit is 5MB Oops file upload failed, please try again!!! Uploading... ABOUT ASIAN PAINTS 75+ Years ofInnovation in Paint HISTORY All Great Things Start Small The company has come a long way since its small beginnings in 1942. It was set up as a partnership firm by four friends who were willing to take on the world\\'s biggest, most famous paint companies operating in India at that time. Over the course of 25 years, Asian Paints became a corporate force and India\\'s leading paints c', 'images': [{'url': 'https://static.asianpaints.com/content/dam/apcolourcatalogue/splash-popup/mobile-home-decor-image.webp', 'alt_text': 'mobile-home-decor-image', 'width': '290', 'height': '260', 'loading': 'eager', 'confidence': 0.8999999999999999}, {'url': 'https://static.asianpaints.com/content/dam/apcolourcatalogue/splash-popup/mobile-paint-textures-image-40.webp', 'alt_text': 'mobile-paint-textures-image-40', 'width': '290', 'height': '260', 'loading': 'eager', 'confidence': 0.8999999999999999}, {'url': 'https://static.asianpaints.com/content/dam/apcolourcatalogue/asset/ap-revamp/static-pages/about-us/desktop-images/mascot.png', 'alt_text': 'A sketch of a man with a paint brush in his hand', 'title': 'A sketch of a man with a paint brush in his hand', 'loading': 'eager', 'confidence': 0.7}, {'url': 'https://static.asianpaints.com/content/dam/asianpaints/website/secondary-navigation/about-us/board-of-directors/RSeshasayee1.jpg', 'alt_text': 'R Seshasayee - Non-Executive Chairman / Independent', 'title': 'R Seshasayee - Non-Executive Chairman / Independent', 'loading': 'eager', 'confidence': 0.7}, {'url': 'https://static.asianpaints.com/content/dam/asianpaints/website/secondary-navigation/about-us/board-of-directors/Manish.jpg', 'alt_text': 'Manish Choksi - Non-Executive Vice Chairman', 'title': 'Manish Choksi - Non-Executive Vice Chairman', 'loading': 'eager', 'confidence': 0.7}], 'rank': 1}, {'url': 'https://en.wikipedia.org/wiki/Asian_Paints', 'content': \"Asian Paints - Wikipedia Home Random Nearby Log in Settings Donate Now If Wikipedia is useful to you, please give today. About Wikipedia Disclaimers Search Asian Paints Article Talk Language Watch Edit Asian Paints Ltd is an Indian multinational paint company, headquartered in Mumbai . [ 2 ] The company is engaged in the business of manufacturing, selling and distribution of paints, coatings, products related to home dcor, bath fittings and providing related services. Asian Paints Ltd. Formerly Asian Oil and Paint Company Pvt. Ltd. (19451965) [ 1 ] Asian Paints (India) Pvt. Ltd. (19651973) [ 1 ] Company type Public Traded as BSE : 50082 NSE : ASIANPAINT BSE SENSEX constituent NSE NIFTY 50 constituent ISIN INE021A01026 Industry Chemicals Founded 1February 1942 ; 83 years ago ( 1942-02-01 ) Founders Champaklal Choksey Chimanlal Choksi Suryakant Dani Arvind Vakil [ 2 ] Headquarters Mumbai , Maharashtra , India Area served Worldwide Key people Manish Choksi ( Vice Chairman ) Amit Syngle ( CEO ) Products Chemicals Decorative paints Industrial finishing products Coatings Revenue 36,183 crore (US$4.3billion) (2024) Operating income 7,215 crore (US$850million) (2024) Net income 5,558 crore (US$660million) (2024) Total assets 29,924 crore (US$3.5billion) (2024) Total equity 19,424 crore (US$2.3billion) (2024) Number of employees 9,482 permanent & 21,189 contractual (2024) [ 3 ] Website asianpaints.com Footnotes/ references Financials as of 31March2024 [update] . [ 4 ] Asian Paints is India's largest paints company by market share. [ 5 ] [ 6 ] The company has 27 paint manufacturing facilities in 15 countries, servicing consumers in over 60 countries. Asian Paints is also present in the home improvement and dcor space in India. [ 7 ] Contents 1 History 2 Corporate structure 2.1 Ownership 2.2 Shareholding pattern 3 Manufacturing locations 4 Marketing and advertising 5 References 6 External links History edit The company was started in a garage in Gaiwadi, Girgaon , Mumbai by four friends Champaklal Choksey, Chimanlal Choksi, Suryakant Dani and Arvind Vakil, in February 1942. [ 2 ] During World War II and the Quit India Movement of 1942, a temporary ban on paint imports left only foreign companies and Shalimar Paints in the market. Asian Paints took up the market and reported an annual turnover of 23 crore in 1952 but with only 2% PBT margin. By 1967, it became the leading paints manufacturer in the country. [ 8 ] [ 9 ] Asian Paints established its first overseas subsidiary in 1978 in Fiji , [ 10 ] before expanding into Nepal in 1983. [ 11 ] The company made its first international acquisition in 1999, when it took over Sri Lanka 's second largest paint company, Delmege Forsyth & Co. [ 12 ] In 2000, it began operations in Oman through a joint venture with the Al Hassan Group. [ 13 ] In 2002, Asian Paints acquired a 60% stake in Egyptian paint manufacturer SCIB Chemicals for 24.5 crore (US$5.04 million). [ 14 ] It also acquired a 50.1% stake in the SGX -listed Berger International Singapore, which had operations in 11 countries across Southeast Asia , West Asia , the Caribbean , China and Malta , for US$20.8 million. [ 15 ] Later that year, it entered the Bangladesh market by incorporating a joint venture with Confidence Group . [ 16 ] In 2003, it acquired Taubmans Paints, which functioned in Fiji and Samoa ; this added to Asian Paints' existing presence in the region under Apco Coatings brand in Fiji, Solomon Islands , Vanuatu and Tonga . [ 17 ] In 2004, the company sold its stake in the Malta subsidiary, which was its only venture in Europe. [ 18 ] By 2010, it ceased its loss-making operations in Malaysia, Hong Kong, Thailand and China. [ 19 ] In 2013, Asian Paints increased its stake in Berger International Singapore to 96.48%. [ 20 ] In 2014, it entered Indonesia through the Singapore subsidiary. [ 21 ] In India, the company ventured into home improvement and dcor with the acquisitions of modular kitchen manufacturer Sleek Intern\", 'images': [], 'rank': 2}, {'url': 'https://www.linkedin.com/pulse/evolution-asian-paints-business-strategy-through-decades-suraj-jha-rfwcf', 'content': 'The Evolution of Asian Paints\\' Business Strategy Through the Decades Agree & Join LinkedIn By clicking Continue to join or sign in, you agree to LinkedIns User Agreement , Privacy Policy , and Cookie Policy . Sign in to view more content Create your free account or sign in to continue your search Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIns User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIns User Agreement , Privacy Policy , and Cookie Policy . Skip to main content LinkedIn Join now Sign in Source : INTERNET The Evolution of Asian Paints\\' Business Strategy Through the Decades Report this article Close menu Suraj Jha Suraj Jha Assistant Manager at JSW Paints Published Jan 24, 2025 + Follow Asian Paints, a household name in India and one of the largest paint manufacturers in the world, has built a legacy of excellence over eight decades. Its journey from a modest paint company to a global leader in home dcor is a story of visionary strategy, innovation, and adaptability. Lets explore how its business strategy evolved through the decades. 19421960s: Foundation and Market Focus Founded in 1942 by four friends, Asian Paints started as a small enterprise, focusing on supplying paints to Indian households during World War II. Its first strategic move was targeting domestic consumers rather than industrial clients , which was the norm for most competitors. The company emphasized affordability and availability, setting itself apart in a market dominated by global players. By the 1950s, Asian Paints adopted a decentralized production strategy to serve a geographically diverse market. This allowed it to respond quickly to demand across the country, even in remote areas. 1970s1980s: Distribution as a Competitive Advantage In the 1970s, Asian Paints revolutionized the industry with its dealer-centric distribution model , ensuring paint availability in rural and urban markets alike. The company built a robust network of dealers, enabling faster product delivery and better customer service. To support its growing scale, Asian Paints also invested in technology-led supply chain management , such as deploying IT systems for real-time inventory tracking. This gave it an edge over competitors who relied on outdated manual systems. The iconic mascot \"Gattu\" was introduced in 1954 and remained central to its branding strategy for decades, making the brand synonymous with trust and quality in Indian households. 1990s: Branding and Customer-Centric Innovation With liberalization in the 1990s, Asian Paints embraced branding and marketing innovation to stand out in an increasingly competitive market. It shifted from a functional product focus to creating an emotional connection with consumers. Campaigns like Har Ghar Kuch Kehta Hai (Every home tells a story) positioned the brand as part of every homes journey. Asian Paints also recognized changing consumer behavior and introduced pre-mixed, ready-to-use paints in smaller packs, making it easier for middle-class households to access high-quality products. 2000s: Diversification and Digital Transformation In the 2000s, Asian Paints expanded its vision from being just a paint manufacturer to becoming a home dcor solutions provider . This was achieved through vertical and horizontal diversification: Recommended by LinkedIn The Global Furniture Industry in 2024: Trends Gaurav Mehta 1 month ago The Acceptable Strategy M. Ik Deliorman, CCMP, MA 1 year ago IKEA Business Case Study: How to Earn $40 Billion Ravi Kanth Satyala 12 months ago The launch of Asian Paints Home Solutions , providing painting services and consultations. Entry into related segments like wallpapers, waterproofing solutions, and furniture coatings. The company also embraced digital transformation , launching tools like the C', 'images': [], 'rank': 3}, {'url': 'https://economictimes.indiatimes.com/asian-paints-ltd/infocompanyhistory/companyid-14034.cms', 'content': \"Asian Paints History | Asian Paints Information - The Economic Times Benchmarks Nifty 24,363.30 -232.86 FEATURED FUNDS UTI Aggressive Hybrid Fund Regular Plan-Growth 5Y Return 19.69 % Invest Now FEATURED FUNDS  HSBC Large Cap Fund Direct-Growth 5Y Return 18.17 % Invest Now Enter search text: English Edition English Edition     | 09 August, 2025, 04:04 PM IST | Today's ePaper My Watchlist Subscribe Sign In Home ETPrime Markets Market Data AI Masterclass News Industry SME Politics Wealth MF Tech AI Careers Opinion NRI Panache More Menu Stocks News Live Blog Stock Live Blog Earnings Podcast Market Classroom Dons of Dalal Street Recos Stock Reports Plus New My Screener Candlestick Screener Stock Screener Stock Watch Market Calendar Stock Price Quotes Options IPOs/FPOs Expert Views Investment Ideas Commodities Views News Others Mentha Oil Precious Metals Gold M Gold Silver Gold Petal Silver Micro Silver M Gold Guinea Spices Cardamom Oil & Energy Natural Gas Crude Oil Crude Oil Mini Base Metals Aluminium Zinc Mini Lead Mini Copper Zinc Nickel Aluminium Mini Lead Plantation Kapas Cotton Candy Cotton Forex Forex News Currency Converter Live Stream! AIF PMS Crypto Crypto News Crypto TV Crypto Prices Bonds More Digital Real Estate Realty News Technicals Technical Chart Visualize Screener Mind Over Money Web Stories Markets Data Unlisted Companies Market Moguls Webinars Sitemap Definitions Business News Markets Stocks Stock Price Quotes Asian Paints Share Price Asian Paints History Summary Prices Financials Reports Company Info News Competitors History Management Background Listing Locations Board Meetings AGM/EGM Dividends Bonus Rights Splits IPO ET 500 Rank 2021 74 Asian Paints History BSE: 500820 | NSE: ASIANPAINTEQ | IND: Paints/Varnishes | ISIN code: INE021A01026 | SECT: Building Materials PREMARKET BSE Change: Volume: Open: Prv. Close: Today: 52-Wk: Bid: ( ) Offer: ( ) NSE Change: Volume: Open: Prv. Close: Today: 52-Wk: Bid: ( ) Offer: ( ) The Company History page lists out the major events in chronological order for Asian Paints Ltd. Company History - Asian Paints Ltd. 1945 - The Company was incorporated as a private limited company under the name of Asian Oil and Paint Company Pvt. Ltd. It was converted into a public limited company in 1973. The Company manufacture a wide range of surface coatings catering to different end-uses. It also manufactures vinyl pyridine latex used in the manufacture of rubber tyres. - The company expanded its products range, developed its own technology, set up a distribution network penetrating in smaller towns and ploughed back a large part of earnings into creation of new facilities. 1965 - The name was changed from Asian Oil and Paint Company Pvt. Ltd. to Asian Paints (India) Pvt. Ltd. 1974 - A major modernisation programme was undertaken to streamline the paint production facilities by improving the layout of machines, addition to balancing equipment and replacement of old machinery. The Company embarked on phased modernisation of resin manufacturing facilities as well. - The Bhandup plant of the Company is reportedly the largest single paint factory in the country and one of the most up-to-date with sophisticated machinery and equipment for manufacturing a wide range of paints and other products besides adequate resin manufacturing capacity to meet its entire requirements. 1975 - Bonus Equity shares issued in the prop. 1:2 in 1961, 1:3 in 1962, 1:1 in 1966, 1:2 in 1969, 2:3 in 1971 and 1:2 in 1975. 1978 - 1,00,000 Bonus Equity shares issued in the prop. 2:3. 1980 - 50,000 unclassified shares classified as prefernece shares and issued. They are redeemable during the period 30.6.1987/1990. 1982 - The main objects of the public issue of capital during August, were to fulfill the listing requirements of the Stock Exchange and to provide part of the finance for the increased operations. 1983 - Equity shares subdivided. 10,00,000 Bonus shares issued in prop. 2:5, 16,85,185 No. of Equ\", 'images': [], 'rank': 4}, {'url': 'https://enrichmoney.in/blog-article/asian-paints-history-subsidiaries-and-share-price', 'content': \"Asian Paints: History, Latest Updates, Milestones, Subsidiaries & Share Price About Research Equity Report Nifty and Bank Nifty Market Outlooks Commodity Report Gold, Crude Oil, Silver, Natural Gas, etc Live Level Support, Resistance and Pivot Levels Expert Webinar Online Sessions from Industry Experts Knowledge Center Learn Fundamental and Technical Analysis Pricing Orca Partner Login Open Demat Blog Stocks Asian Paints: History, Latest Updates, Milestones, Subsidiaries & Share Price Asian Paints: History, Latest Updates, Milestones, Subsidiaries & Share Price Introduction Asian Paints manufactures a wide range of paints for decoration and industrial use. It offers products for wall coverings, water proofing, adhesives and services too. It also offers interior designing, along with decors for bath and kitchen rooms. It has also included lightnings, furnishings and furniture in its portfolio. Asian Paints has entered into an agreement with Weatherseal Fenestration for engaging in the business of interior decoration / furnishing. The company has also entered into an agreement with White Teak firm to involve in business of decorative lightning products and fans Asian PaintsMoves In 2025: January 2025 Asian Paints witnessed a significant decline in its stock valuation, reaching its lowest point in the past 52 weeks. The downturn was primarily on account of muted investor sentiments and prevailing market woes, placing pressure on the stock's performance against benchmark indices. February 2025 The Q3 FY25 results of the company reported a year-over-year fall in net profit by more than 20%. Operating margins also narrowed on account of higher input costs and competitive pricing, leading to concerns over future earnings momentum. March 2025 Asian Paints initiated leadership changes in its global operations. Joseph Eapen was elevated to head its global business, a decision to enhance the company's international presence and consolidate expansion plans. April 2025 Increased competition from Aditya Birla's recently introduced brand 'Birla Opus' started affecting Asian Paints' market position. The aggressive pricing policy of the competitor put pressure on the decorative paints segment. May 2025 In Q4 FY25, Asian Paints reported a steep decline in profitalmost 45% lower year-on-yearbecause of soft domestic demand and a one-time loss associated with exiting its Indonesia business. Asian Paints Moves In 2023-2024: Asian Paints has made an announcement of their financial results for the Q1, Q2 and Q3 quarter for the financial year 2024. Asian Paints share price today (23.01.2024) is Rs. 3061.65. Asian Paints share price is also trading at a bearish price change of -2.61%. Evolution Of Asian Paints: From Past to Present: Year Evolution 1942 Founding of Asian Paints in Bombay (now Mumbai) by four visionary friends. 1945 Establishment of the company under the name Asian Oil and Paint Company Pvt. Ltd., with a focus on surface coatings and latex for rubber tires. 1965 Change of the company's name to Asian Paints (India) Pvt. Ltd. 1973 Conversion of Asian Paints into a Public Limited Company. 1975 Issuance of bonus equity shares to shareholders. 1985 Expansion with new paint units in Patancheru and collaboration with Nippon Paints for powder coatings. 1987 Entry into synthetic rubber lattices production and receipt of a letter of intent for phthalic anhydride manufacturing. 1988 Issuance of secured non-convertible debentures to financial institutions. 1990 Expansion to Fiji, Tonga, Australia, and collaborations in Nepal and Sri Lanka. 1991 Pentasia Chemicals Ltd. became a subsidiary and later merge into Asian Paints. 1993 Operations expanded to Australia, and a joint venture with Mauritius was established. 1995 Expansion of manufacturing capacities in Visakhapatnam, and collaboration with PT Abadi Coating Solusi, Indonesia. 1996 Formation of a joint venture with PPG Industries, USA, for automotive paints. 1999 Acquisition of a majority stake in\", 'images': [{'url': 'https://fileserver.enrichmoney.in/Content\\\\UploadedFiles\\\\MFXWyIfx-KM85UniE3-zy6f3_20240228102425357.jpg', 'alt_text': 'Asian Paints', 'width': '1000', 'height': '500', 'confidence': 0.8999999999999999}, {'url': 'https://enrichmoney.in/_next/image?url=%2Fimages%2Fhero%2Fwhatsapp.png&w=1920&q=75', 'alt_text': 'Enrich money logo', 'width': '800', 'height': '800', 'loading': 'lazy', 'confidence': 0.8999999999999999}], 'rank': 5}, {'url': 'https://mostvaluablebrands.com/2024/06/asian-paints-a-most-valuable-brand-story/', 'content': '[not extracted] Content limit reached', 'rank': 6}, {'url': 'https://dcfmodeling.com/blogs/history/asianpaintns-history-mission-ownership', 'content': '[not extracted] Content limit reached', 'rank': 7}, {'url': 'https://enlightenedpost.com/behind-the-brand-the-story-of-asian-paints/', 'content': '[not extracted] Content limit reached', 'rank': 8}]",
            "annotations": null
          }
        ]
      },
      "error": null,
      "cost": 0.0,
      "start_time": "2025-08-09T10:36:56.067186",
      "end_time": "2025-08-09T10:37:43.866073",
      "execution_time": 47.798887,
      "input_tokens": 0,
      "output_tokens": 0,
      "execution_result": null
    },
    {
      "id": "T002",
      "description": "Retrieve Asian Paints' financial performance data (revenue, profit, expenses) for the last 5 years.",
      "agent": "RetrieverAgent",
      "agent_prompt": "Collect Asian Paints' financial data for the past 5 years, including annual revenue, net profit, operating expenses, earnings per share, and key financial ratios. Ensure the data is verifiable and comes from reliable sources such as company reports, financial news outlets, or reputable financial databases.",
      "reads": [],
      "writes": [
        "T002"
      ],
      "status": "completed",
      "output": {
        "financial_data": [
          {
            "type": "text",
            "text": "[{'url': 'https://www.moneycontrol.com/financials/asianpaints/ratiosVI/AP31', 'content': 'Asian Paints Key Financial Ratios, Asian Paints Financial Statement & Accounts English Hindi Gujarati Specials Search Quotes, News, Mutual Fund NAVs Trending Stocks NSDL INE301O01023, , 544467 Kalyan Jeweller INE303R01014, KALYANKJIL, 543278 BSE Limited INE118H01025, BSE, 0 Sri Lotus Devel INE0V9Q01010, LOTUSDEV, 544469 Reliance Power INE614G01033, RPOWER, 532939 Quotes Mutual Funds Commodities Futures & Options Currency News Cryptocurrency Forum Notices Videos Glossary All Hello, Login Hello, Login Log-in or Sign-Up My Account My Profile My Portfolio My Watchlist My Alerts My Messages Price Alerts My Profile My PRO My Portfolio My Watchlist My Alerts My Messages Price Alerts Logout Loans up to 50 LAKHS Fixed Deposits Credit Cards Lifetime Free Credit Score Chat with Us Download App Follow us on: Go Ad-Free My Alerts mcmarketstockprice->Moneycontrol/MC_Market/MC_Market_StockPrice_728x90|~|Moneycontrol/MC_Market/MC_Market_StockPrice_300x250|~|Moneycontrol/MC_Market/MC_Market_StockPrice_728x90_2|~|Moneycontrol/MC_Market/MC_Market_StockPrice_728x90_1|~|Moneycontrol/MC_Market/MC_Market_StockPrice_300x250_2|~|Moneycontrol/MC_Market/MC_Market_StockPrice_300x250_1|~|Moneycontrol/MC_Market/MC_Market_StockPrice_300x250_BTF|~|Moneycontrol/MC_PriceChart/MC_PriceChart_300x250_ATF|~|Moneycontrol/MC_PriceChart/MC_PriceChart_728x90_ATF|~|Moneycontrol/MC_PriceChart/MC_PriceChart_728x90_BTF|~|Moneycontrol/MC_Market/MC_Market_StockPrice_300x250/MC_Market_StockPrice_Notices_300x250_ATF|~|Moneycontrol/MC_Market/MC_Market_StockPrice_QuartResult_728x90|~|Moneycontrol/MC_Market/MC_Market_StockPrice_CapitalStruc_728x90|~|Moneycontrol/MC_Market/MC_Market_StockPrice_PriceChart_728x90|~|Moneycontrol/MC_Market/MC_Market_StockPrice_History_300x600_ATF|~|Moneycontrol/MC_PriceChart/MC_PriceChart_300x250_ATF_1|~|Moneycontrol/MC_PriceChart/MC_PriceChart_728x90_ATF_1|~|Moneycontrol/MC_PriceChart/MC_PriceChart_300x250_MTF-> Go PRO Now PRO PRO Markets HOME INDIAN INDICES STOCK ACTION All Stats Top Gainers Top Losers Only Buyers Only Sellers 52 Week High 52 Week Low Price Shockers Volume Shockers Most Active Stocks GLOBAL MARKETS ETFs US MARKETS UNLISTED SHARES STOCK SCANNER Fundamental Scanner Technical Scanner ECONOMIC INDICATORS ECONOMIC CALENDAR MARKET ACTION F&O FII & DII Activity Corporate Action EARNINGS DEALS Bulk Deals Block Deals Intraday Large Deals SECTOR ANALYSIS PRE MARKET SEASONALITY ANALYSIS RESEARCH Investment Advice Technicals COMMODITY CURRENCY CRYPTOCURRENCY TECHNICAL TRENDS IPO BONDS WEBINAR SWING TRADING MASTERCLASS MC LEARN TRADERS CONCLAVE INTERVIEW SERIES OTHERS Cryptocurrency News Tools News LATEST NEWS Assembly Elections BUSINESS Economy Companies Mutual Funds Personal Finance IPO Startup Real Estate Bank Holidays 2025 Banking NATION & WORLD India City World Politics MARKETS Stocks Technical Analysis Equity Research Commodities Currency Gold Rate Silver Rate AQI SPECIAL Trends Opinion Explainers MC Buzz MC Features MC Learn TECHNOLOGY Personal Tech Auto Fintech MEDIA Podcast Photos Videos Web Stories CRYPTO DASHBOARD PETROL PRICE IN INDIA DIESEL PRICE IN INDIA MONSOON TRACKER OTHERS Entertainment Sports Lifestyle Health and Fitness Education Jobs Science Astro Religion Travel Editors Picks Tech India Learning Curve Portfolio Watchlist Commodities MF EXPLORE Home Find Fund Top Ranked Funds Performance Tracker SIP Performance Tracker ETFs NFO Top Performing Categories Learn TOOLS Returns Calculator Lumpsum SIP Balancer Delay Cost Calculator MF FORUM TRACK Your MF Investment MF Prices Personal Finance EXPLORE Home Investing Insurance Banking Financial Planning Property Tools Video Ask Expert Explainer NPS FIXED DEPOSIT FDs @ 8.4% p.a. Fixed Deposit Comparison Fixed Deposit Interest Calculator Corporate Deposits TAX Income tax Filing Guide Income Tax Calculator LTCG Tax on Property BANK HOLIDAYS 2025 LOANS & CREDIT CARDS Loans Loans up to 50 LAKHS Pick your Loan Amount 50K Personal Loan 1L Personal Loan 2L Personal Loan 5L Personal Loan 10L', 'images': [], 'rank': 1}, {'url': 'https://tickjournal.com/stock-screener/asian-paints-ltd/financial-statements/', 'content': '[no text]', 'images': [], 'rank': 2}, {'url': 'https://www.wsj.com/market-data/quotes/IN/XNSE/ASIANPAINT/financials', 'content': \"Skip to Main Content The Wall Street Journal English Edition Edition Use Alt + Down Arrow to expand. English (Chinese) (Japanese) Print Edition Video Audio Latest Headlines More More Other Products from WSJ Buy Side from WSJ The Journal Collection WSJ Shop WSJ Wine Latest World Business U.S. Politics Economy Tech Markets & Finance Opinion Arts Lifestyle Real Estate Personal Finance Health Style Sports The Wall Street Journal English Edition Edition Use Alt + Down Arrow to expand. English (Chinese) (Japanese) Print Edition Video Audio Latest Headlines More More Other Products from WSJ Buy Side from WSJ The Journal Collection WSJ Shop WSJ Wine Latest World Business U.S. Politics Economy Tech Markets & Finance Opinion Arts Lifestyle Real Estate Personal Finance Health Style Sports 404 Page Not Found We cant find the page you're looking for. If you typed the URL into your browser, check that you entered it correctly. If you reached this page via our site or search, please let us know by emailing support@wsj.com POPULAR ARTICLES Putin Tells U.S. Hell Halt War in Exchange for Eastern Ukraine The Influencer Driving Nantucket Crazy This Summer Why the Far Right Hates Churchill LATEST PODCASTS View All Whats News in Markets: Apples Investment, Fannie and Freddies IPO, Crocs Misstep Whats News in Markets: Apples Investment, Fannie and Freddies IPO, Crocs Misstep Donald Trump's Order Targeting 'Debanking'\", 'images': [], 'rank': 3}, {'url': 'https://www.smart-investing.in/mainFinancials.php?Company=ASIAN+PAINTS+LTD', 'content': '[BOM: 500820|NSE : ASIANPAINT] ASIAN PAINTS Financial Statement Analysis-Aug 09,2025 Browse Search Stocks Stock Analytics Annual Financials Quarterly Financials P/E (Price/Earnings) ratio P/B (Price/Book) ratio P/S (Price/Sales) ratio BSE & NSE Indices Top Gainers & Losers Top Companies by Industry Top Companies by Sector Pricing Tools Screener Compare Financial Ratios Income Statements Balance Sheets Cashflow Statements Shareholding Pattern Learn Video Courses Stock Market Investing Simplified Value Investing - The Ultimate Guide Technical Analysis - The Ultimate Guide Mutual Funds Investing Simplified Excel for Finance About About Us Contact Us LOGIN > x TOOLS Screener Compare RESEARCH Stock Analytics Financial Summary Financial Ratios Income Statement Balance Sheet Cashflow Statement Shareholding Pattern Quarterly Results Price/Earnings(PE) Ratio Price/Book(PB) Ratio Price/Sales(PS) Ratio LEARN Stock Market Investing Value Investing Technical Analysis Mutual Funds Investing Excel for Finance Home > Annual Financials > ASIAN PAINTS Search Limits / month This is the monthly limit on the various pages on our platform as per your subscription. See Pricing 1 count = 1 stock search , 1 screener search, 2 stock comparison If you search same stock multiple times, it would add to the count of total searches done. This count will be reset on 1st of every month at 12 am IST. Limits per month PRO PLUS STARTER BASIC (FREE) Stock Analytics Searches UNLIMITED 500 200 20 Stock Data Searches UNLIMITED 500 200 20 Stock Comparison Searches UNLIMITED 250 100 10 Stock Screener Searches UNLIMITED 20 10 3 Max Results per Screener 50 20 10 10 Access to Screeners ALL Limited Minimal Minimal See More Details ASIAN PAINTS Financial Statement Analysis [BOM: 500820|NSE : ASIANPAINT] The Revenues of ASIAN PAINTS have decreased by -4.48% YoY . The Earnings Per Share (EPS) of ASIAN PAINTS has decreased by -32.84 % YoY . REVENUES OPERATING MARGIN PROFIT AFTER TAX EPS ROCE ASIAN PAINTS Last 5 Annual Financial Results [BOM: 500820|NSE : ASIANPAINT] Consolidated Mar2025 Mar2024 Mar2023 Mar2022 Mar2021 Revenues 33,906 Cr 35,495 Cr 34,489 Cr 29,101 Cr 21,713 Cr Expenses 27,899 Cr 27,910 Cr 28,229 Cr 24,298 Cr 16,857 Cr Operating Profit (Excl OI) 6,006 Cr 7,585 Cr 6,260 Cr 4,804 Cr 4,856 Cr Other Income 573 Cr 688 Cr 386 Cr 380 Cr 303 Cr Interest 227 Cr 205 Cr 144 Cr 95 Cr 92 Cr Depreciation 1,026 Cr 853 Cr 858 Cr 816 Cr 791 Cr Profit Before Tax 5,103 Cr 7,348 Cr 5,689 Cr 4,188 Cr 4,304 Cr Profit After Tax 3,710 Cr 5,558 Cr 4,195 Cr 3,085 Cr 3,207 Cr Consolidated Net Profit 3,667 Cr 5,460 Cr 4,106 Cr 3,031 Cr 3,139 Cr Earnings Per Share (Rs) 38.23 56.92 42.81 31.59 32.73 PAT Margin (%) 8.85 12.97 10.21 8.97 12.60 ROE(%) 19.51 32.08 28.19 23.19 27.96 ROCE(%) 26.58 41.05 36.98 30.88 37.19 Total Debt/Equity(x) 0.04 0.06 0.06 0.06 0.03 Key Financials Market Cap : 237,440.4 Cr Revenue (TTM) : 33,874.4 Cr Net Profit(TTM) : 3,499.7 Cr EPS (TTM) : 36.5 P/E (TTM) : 67.8 Industry Peers & Returns 1W 1M 1Y ASIAN PAINTS 1.1% 1% -19.2% BERGER PAINTS INDIA -3.8% -5.1% 2.2% KANSAI NEROLAC PAINTS -4.4% -6.3% -21.9% AKZO NOBEL INDIA -2.1% 1.3% 13.1% INDIGO PAINTS -3.1% -3.6% -18% SHALIMAR PAINTS -4.2% -23.1% -48.8% What is the Fundamental Analysis of ASIAN PAINTS ? ASIAN PAINTS Revenues [BOM: 500820|NSE : ASIANPAINT] Y-o-Y -4.48 % 5 Yr CAGR 11.79 % Years Revenues % Change Mar2025 33,906 Cr -4.48 Mar2024 35,495 Cr 2.92 Mar2023 34,489 Cr 18.51 Mar2022 29,101 Cr 34.03 Mar2021 21,713 Cr - What is the Valuation of ASIAN PAINTS ? ASIAN PAINTS Operating Profit [BOM: 500820|NSE : ASIANPAINT] Y-o-Y -20.81 % 5 Yr CAGR 5.46 % Years Operating Profit % Change Mar2025 6,006 Cr -20.81 Mar2024 7,585 Cr 21.17 Mar2023 6,260 Cr 30.32 Mar2022 4,804 Cr -1.07 Mar2021 4,856 Cr - Operating Margins Y-o-Y -17.13 % 5 Yr CAGR -5.66 % Years Operating Margin% % Change Mar2025 17.71% -17.13 Mar2024 21.37% 17.74 Mar2023 18.15% 9.93 Mar2022 16.51% -26.16 Mar2021 22.36% - ASIAN PAINTS Profit After', 'images': [{'url': 'https://www.smart-investing.in/images/Marketing/Smart-Investing_Intro.png', 'alt_text': 'Smart-Investing', 'class': 'img-fluid', 'confidence': 0.7}, {'url': 'https://www.smart-investing.in/images/video_course/value-investing-video-course.png', 'alt_text': 'Value Investing Bootcamp', 'title': 'Value Investing Bootcamp', 'width': '350px', 'class': 'img-fluid', 'loading': 'lazy', 'confidence': 0.7}, {'url': 'https://www.smart-investing.in/images/video_course/technical-analysis-video-course.png', 'alt_text': 'Technical Analysis Masterclass', 'title': 'Technical Analysis Masterclass', 'width': '350px', 'class': 'img-fluid', 'loading': 'lazy', 'confidence': 0.7}, {'url': 'https://www.smart-investing.in/images/video_course/MutualFunds-Investing-Simplified-Video-Course.png', 'alt_text': 'Mutual Funds Investing Simplified', 'title': 'Mutual Funds Investing Simplified', 'width': '350px', 'class': 'img-fluid', 'loading': 'lazy', 'confidence': 0.7}], 'rank': 4}, {'url': 'https://stockanalysis.com/quote/nse/ASIANPAINT/financials/ratios/', 'content': \"Asian Paints (NSE:ASIANPAINT) Financial Ratios and Metrics Skip to main content Log In Sign Up Home Stocks Stock Screener Stock Exchanges Comparison Tool Earnings Calendar By Industry Stock Lists Top Analysts Top Stocks Corporate Actions IPOs Recent IPOs IPO Calendar IPO Statistics IPO News IPO Screener ETFs ETF Screener Comparison Tool New Launches ETF Providers News Trending Articles Technical Chart Market Movers Top Gainers Top Losers Most Active Premarket After Hours Market Heatmap Market Newsletter Stock Analysis Pro Watchlist Collapse Asian Paints Limited (NSE:ASIANPAINT) India Delayed Price Currency is INR 2,475.60 -30.90 (-1.23%) Aug 8, 2025, 3:30 PM IST Overview Financials Statistics Dividends History Profile Chart Income Balance Sheet Cash Flow Ratios Annual Quarterly TTM AMK Ratios and Metrics Market cap in millions INR. Fiscal year is April - March. Millions INR. Fiscal year is Apr - Mar. Current Mil Millions Data Data Source Download Full Width Fiscal Year Current FY 2025 FY 2024 FY 2023 FY 2022 FY 2021 2017 - 2021 Period Ending Aug '25 Aug 8, 2025 Mar '25 Mar 31, 2025 Mar '24 Mar 31, 2024 Mar '23 Mar 31, 2023 Mar '22 Mar 31, 2022 Mar '21 Mar 31, 2021 2017 - 2021 Market Capitalization 2,374,590 2,245,146 2,730,596 2,648,969 2,954,281 2,433,868 Upgrade Market Cap Growth -19.74% -17.78% 3.08% -10.33% 21.38% 52.26% Upgrade Enterprise Value 2,357,164 2,248,587 2,720,035 2,646,482 2,937,249 2,423,015 Upgrade Last Close Price 2475.60 2319.25 2788.91 2682.96 2970.76 2432.52 Upgrade PE Ratio 65.98 61.22 50.01 64.51 97.48 77.53 Upgrade Forward PE 55.71 53.55 53.39 56.64 81.35 56.61 Upgrade PS Ratio 7.02 6.63 7.71 7.69 10.19 11.32 Upgrade PB Ratio 11.84 11.19 14.06 16.11 20.81 18.40 Upgrade P/TBV Ratio 12.62 11.94 15.27 17.01 22.08 19.84 Upgrade P/FCF Ratio - 85.74 69.93 90.72 659.07 71.55 Upgrade P/OCF Ratio - 50.75 44.74 63.17 299.47 66.08 Upgrade PEG Ratio 5.33 23.86 3.48 3.03 4.06 3.14 Upgrade EV/Sales Ratio 6.97 6.64 7.68 7.69 10.14 11.27 Upgrade EV/EBITDA Ratio 39.19 40.13 37.61 43.96 64.72 52.52 Upgrade EV/EBIT Ratio 47.35 45.15 40.34 48.44 73.67 59.62 Upgrade EV/FCF Ratio - 85.87 69.66 90.63 655.27 71.23 Upgrade Debt / Equity Ratio 0.11 0.11 0.13 0.12 0.11 0.08 Upgrade Debt / EBITDA Ratio 0.39 0.38 0.33 0.31 0.33 0.23 Upgrade Debt / FCF Ratio - 0.88 0.63 0.66 3.54 0.32 Upgrade Asset Turnover - 1.12 1.27 1.41 1.34 1.18 Upgrade Inventory Turnover - 3.12 3.34 3.45 3.71 3.40 Upgrade Quick Ratio - 1.16 1.27 1.23 1.11 1.29 Upgrade Current Ratio - 2.09 2.06 2.09 2.00 2.03 Upgrade Return on Equity (ROE) - 18.79% 30.99% 27.38% 22.49% 26.99% Upgrade Return on Assets (ROA) - 10.32% 15.13% 14.00% 11.50% 13.91% Upgrade Return on Capital (ROIC) 13.67% 14.07% 20.93% 19.99% 16.55% 19.56% Upgrade Return on Capital Employed (ROCE) - 22.40% 31.50% 30.50% 25.90% 28.10% Upgrade Earnings Yield 1.51% 1.63% 2.00% 1.55% 1.03% 1.29% Upgrade FCF Yield - 1.17% 1.43% 1.10% 0.15% 1.40% Upgrade Dividend Yield 0.99% 1.07% 1.19% 0.96% 0.65% 0.73% Upgrade Payout Ratio - 85.63% 46.72% 47.15% 57.45% 15.91% Upgrade Buyback Yield / Dilution 0.02% 0.01% -0.01% 0.02% 0.01% - Upgrade Total Shareholder Return 1.01% 1.08% 1.19% 0.97% 0.66% 0.73% Upgrade Updated Feb 4, 2025. Source: S&P Global Market Intelligence. Standard template. Financial Sources. Sections Stocks IPOs ETFs Blog Services Stock Analysis Pro Free Newsletter Get Support Install The App Website Login Create Account Changelog Sitemap Advertise FAQ Company About Contact Us Terms of Use Privacy Policy Data Disclaimer Affiliate Program Market Newsletter Daily market news in bullet point format. Subscribe Site Theme Light Dark 2025 StockAnalysis.com. All rights reserved.\", 'images': [], 'rank': 5}, {'url': 'https://groww.in/stocks/asian-paints-ltd/company-financial', 'content': '[not extracted] Content limit reached', 'rank': 6}, {'url': 'https://www.etmoney.com/stocks/asian-paints-ltd/financials/944', 'content': '[not extracted] Content limit reached', 'rank': 7}, {'url': 'https://www.globaldata.com/company-profile/asian-paints-ltd/financials/', 'content': '[not extracted] Content limit reached', 'rank': 8}]",
            "annotations": null
          }
        ]
      },
      "error": null,
      "cost": 0.0,
      "start_time": "2025-08-09T10:37:48.881692",
      "end_time": "2025-08-09T10:38:33.946682",
      "execution_time": 45.06499,
      "input_tokens": 0,
      "output_tokens": 0,
      "execution_result": null
    },
    {
      "id": "T003",
      "description": "Retrieve Asian Paints' market share and competitive landscape analysis.",
      "agent": "RetrieverAgent",
      "agent_prompt": "Obtain data on Asian Paints' market share in the paints and coatings industry, both in India and globally. Identify key competitors, their market share, and their respective strengths and weaknesses. Analyze the competitive landscape and the factors influencing market share, such as product innovation, pricing strategies, distribution networks, and marketing campaigns.",
      "reads": [],
      "writes": [
        "T003"
      ],
      "status": "completed",
      "output": {
        "data": [
          {
            "type": "text",
            "text": "[{'url': 'https://www.latterly.org/asian-paints-competitors/', 'content': 'Top Asian Paints Competitors and Alternatives in 2025 Latterly.org Skip to content Contact About Menu Menu Business Marketing Marketing Strategies Technology Life Style Tips and Guides Top Asian Paints Competitors and Alternatives in 2025 As one of Asias largest paint manufacturers, Asian Paints has proven itself as a key player in the global paint industry since its inception in 1942. The company, headquartered in Mumbai, India, offers a wide range of decorative and industrial paints that cater to diverse clients across both residential and commercial sectors. However, the competitive landscape is ever-evolving, requiring a thorough paint industry analysis to understand the various Asian Paints competitors and their market positions. In 2024, notable companies including Berger Paints, Kansai Nerolac Paints, Akzo Nobel India, and Nippon Paint are challenging Asian Paints dominance, each contributing unique product offerings and innovations that impact the overall market comparison. This article provides insight into these leading alternatives as they navigate the dynamic paint market. Key Takeaways Asian Paints is a prominent player in the paint industry, founded in 1942. Berger Paints, founded in 1923, is the second-largest decorative paint company in India. Kansai Nerolac, established in 1920, focuses on automotive and powder coating paints. Akzo Nobel India, known for its diverse coatings, has been operational since 1911. Nippon Paint offers a significant global presence, dating back to 1881. Indigo Paints highlights innovation within the decorative segment since its establishment in 2000. Market trends for 2024 indicate a growing emphasis on sustainability and innovative technologies in the paint industry. Overview of Asian Paints Asian Paints, founded in 1942, has established itself as a prominent paint market leader. The company profile reveals a remarkable journey from its inception to becoming a key player in the Indian paint industry by 1967. Asian Paints currently holds a significant market share of 53%, translating to a revenue of approximately 34,875 crores INR within a valued market of 620 billion INR. Its success is attributed to a well-structured distribution network that integrates dealers, retailers, and service providers, effectively catering to both urban and rural markets across India and beyond. With a diverse product portfolio of over 2200 shades, Asian Paints offers solutions that withstand harsh weather conditions, coupled with warranties extending up to 10 years. The company has proficiently adapted its operational strategies to meet market changes, notably during the COVID-19 pandemic when it shifted to a direct supply model from factories to ensure smooth distribution to Tier 2 and 3 cities. The Asian Paints overview highlights its commitment to sustainability and innovation, evident through campaigns like Beautiful Homes and ColourNext, which not only engage customers but also showcase industry expertise. Their aggressive marketing, leveraging both traditional and digital platforms, has been instrumental in maintaining its reputation and engaging an audience that visited their website over 5.8 million times in September 2023. Financially, Asian Paints reported a revenue of 36,183 crore (US$4.3 billion) in 2024, further solidifying its status as a paint market leader. The operational efficiency is reflected in its impressive operating income of 7,215 crore (US$860 million) and a net income of 5,558 crore (US$670 million) during the same year. The Importance of Competitive Analysis in the Paint Industry In the evolving landscape of the paint industry competition, a thorough competitive analysis remains vital for companies aiming to maintain a strong market presence. As the consumer preferences shift rapidly in 2024, understanding market dynamics becomes imperative for brands like Asian Paints. This approach highlights strengths, weaknesses, opportunities, and threats (SWOT) within the market. Asian P', 'images': [], 'rank': 1}, {'url': 'https://www.mordorintelligence.com/industry-reports/india-paints-and-coatings-market', 'content': \"Paint Industry in India Size, Share & Market Analysis Reports Aerospace & Defense Agriculture Animal Nutrition & Wellness Automotive Chemicals & Materials Consumer Goods and Services Energy & Power Financial Services and Investment Intelligence Food & Beverage Healthcare Home and Property Improvement Hospitality and Tourism Logistics Manufacturing Products and Services Packaging Professional and Commercial Services Real Estate and Construction Retail Technology, Media and Telecom Custom Research About Our Team Our Clients Our Partners Social Responsibility Awards & Recognition FAQs Subscription Careers Contact +1 617-765-2493 Paint Industry in India Size & Share Analysis - Growth Trends & Forecasts (2025 - 2030) The India Paint Industry market report segments the industry into Technology (Water-borne Coatings, Solvent-borne Coatings, Powder Coatings, Radiation Cured Coatings), Resin Type (Acrylic, Alkyd, Polyurethane, Epoxy, Polyester, Other Resin Types (Vinyl, Latex)), and End-User Industry (Architectural, Automotive, Wood, Protective Coatings, General Industrial, Transportation, Packaging). Home Market Analysis Chemicals & Materials Research Paints and Coatings Research India Paints & Coatings Market About This Report Market Snapshot Market Analysis Key Market Trends Segment Analysis Competitive Landscape Major Players Industry Developments Table of Contents SCOPE OF THE REPORT Frequently Asked Questions Download PDF India Paints And Coatings Market Size Market Overview Study Period 2019 - 2030 Base Year For Estimation 2024 Forecast Data Period 2025 - 2030 Market Size (2025) USD 10.46 Billion Market Size (2030) USD 16.37 Billion Growth Rate (2025 - 2030) 9.38% CAGR Market Concentration High Major Players *Disclaimer: Major Players sorted in no particular order Image Mordor Intelligence. Reuse requires attribution under CC BY 4.0. Image Mordor Intelligence. Reuse requires attribution under CC BY 4.0. View Global Report Select Another Geography Asia Bahrain Egypt Europe Iran Iraq Latin America Middle East Middle East Middle East and Africa Morocco North America Oman Pakistan Qatar Saudi Arabia South America South East Asia Sri Lanka United Arab Emirates United States India Paints And Coatings Market Analysis The India Paints And Coatings Market size is estimated at USD 10.46 billion in 2025, and is expected to reach USD 16.37 billion by 2030, at a CAGR of 9.38% during the forecast period (2025-2030). The Indian paints and coatings industry is experiencing robust growth driven by extensive infrastructure development and urbanization initiatives. The construction sector has witnessed significant foreign direct investment inflows, reaching USD 26.24 billion in the construction development sector between April 2000 and September 2022. The government's ambitious Smart City Mission targeting 100 cities and various infrastructure development programs have created substantial demand for architectural coatings. These initiatives, coupled with the rising urban population and increasing disposable income, have fundamentally transformed the market landscape. The manufacturing sector's evolution has created new opportunities for industrial coatings applications. According to the Indian Brand Equity Foundation (IBEF), India has established itself as a major manufacturing hub, with the country possessing the fourth-largest rail network globally, spanning over 67,368 km of railway tracks. The expansion of manufacturing facilities, particularly in sectors like electronics, railways, and industrial equipment, has led to increased demand for specialized industrial coatings. This industrial growth has prompted coating manufacturers to develop innovative solutions that meet specific performance requirements while complying with environmental regulations. Technological advancements and sustainability initiatives are reshaping the industry landscape. The electric vehicle (EV) sector, according to the India Energy Storage Alliance (IESA), is projec\", 'images': [{'url': 'https://s3.mordorintelligence.com/india-paints-and-coatings-market/india-paints-and-coatings-market-size-image-1735449196191.webp', 'alt_text': 'India Paints And Coatings Market Summary', 'width': '300', 'height': '390', 'class': 'rd-img market-size-graph', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://s3.mordorintelligence.com/india-paints-and-coatings-market/india-paints-and-coatings-market-India-Paints-and-Coatings-Market-Market-Share-by-Resin-Type-Segment-2024-1737052102564.webp', 'alt_text': 'Market Analysis of India Paints And Coatings Market: Chart for Resin Type', 'width': '730', 'height': '360', 'class': 'full-width', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://s3.mordorintelligence.com/india-paints-and-coatings-market/india-paints-and-coatings-market_1707463136162_Paint_Industry_in_India_-_Market_Concentration.webp', 'alt_text': 'Paint Industry in India Concentration', 'width': '355', 'height': '318', 'class': 'full-width', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://s3.mordorintelligence.com/india-paints-and-coatings-market/india-paints-and-coatings-market_1707461860176_Paint_Industry_in_India_-_Key_Players.webp', 'alt_text': 'Major players in India Paints And Coatings industry', 'width': '250', 'height': '141', 'class': 'embed-code-context market-players rd-img', 'loading': 'lazy', 'confidence': 0.7}, {'url': 'https://www.mordorintelligence.com/express-img/success_img.png', 'alt_text': 'sucess-icon', 'class': 'success-image full-width', 'loading': 'lazy', 'confidence': 0.7}], 'rank': 2}, {'url': 'https://www.marketing91.com/asian-paints-competitors/', 'content': 'Top 30 Asian Paints Alternatives & Competitors in 2025 Marketing91 Home Discounts and Coupons Marketing Tools Discounts Financial Tools Discounts Brands Analysis Competitors Top Brands Lists SWOT of Brands Brand Ownership Home Competitors Top 30 Asian Paints Competitors & Alternatives in 2024 Top 30 Asian Paints Competitors & Alternatives in 2025 December 2, 2024 | By Hitesh Bhasin | Filed Under: Competitors Asian Paints is a leading paint and coatings company based in India that has established itself as a household name in the construction and home decor industry. In this article, we discuss the top Asian Paints Competitors and Alternatives. Founded in 1942, the company has grown steadily over the years and has become one of the largest paint manufacturers in Asia. Asian Paints offers a wide range of decorative and industrial paints, as well as related products, catering to the needs of both residential and commercial customers. Renowned for its innovative and high-quality products, Asian Paints has transformed the paint industry with its diverse range of colorful, textured, and finished products, enabling customers to customize their spaces creatively. The company emphasizes sustainability by offering eco-friendly paints low in volatile organic compounds (VOCs), making them healthier and environmentally friendly. The brand, recognized for its durability and aesthetic appeal, has built a strong distribution network and customer-centric ethos, earning admiration for its dedication to transforming spaces into inspiring environments. Product Type: Paints, coatings, products related to home decor, bath fittings Industry: Manufacturing Founded Date: February 1, 1942 Founders: Champaklal Choksey, Chimanlal Choksi, Suryakant Dani, Arvind Vakil Headquarters: Mumbai, Maharashtra, India Area Served: Worldwide Current CEO: Amit Syngle Table of Contents Toggle The top Asian Paints competitors are 1. Berger Paints India 2. Kansai Nerolac Paints 3. Akzo Nobel India (AkzoNobel) 4. Nippon Paint 5. PPG Industries 6. Sherwin-Williams 7. Indigo Paints 8. Sirca Paints India 9. Shalimar Paints 10. Jotun Paints India (Jotun) 11. Caparol Paints India (Caparol) 12. Diamond Paints 13. Goodlass Nerolac 14. BASF Coatings 15. RPM International 16. Axalta Coating Systems 17. Benjamin Moore & Co. 18. Sika AG 19. Hempel Group 20. Masco Corporation 21. Valspar Corporation 22. Tikkurila 23. Beckers Group 24. Kwality Paints 25. Majestic Paints 26. Paints & Coatings India 27. Pragati Paints 28. Sterling Paints 29. Kansai Paints India 30. Dulux Paints The top Asian Paints competitors are 1. Berger Paints India Product Type: Paints Industry: Paints and Coatings Founded Date: 1923 Founders: Lewis Berger Headquarters: Kolkata, India Area Served: India and Nepal Current CEO: Abhijit Roy Berger Paints India is Indias second-largest decorative paint company, with a commendable market share and presence in India and across Asia. Its rich history traces back to 1923, symbolizing trust, reliability, and innovation. Bergers eco-friendly, customer-centric approach distinguishes it from other competitors. It offers an exhaustive range of products addressing every painting need, including interior, exterior, metal, and wood. 2. Kansai Nerolac Paints Product Type: Paints Industry: Paints and Coatings Founded Date: 1920 Founders: Katsujiro Iwai Headquarters: Mumbai, India Area Served: India and Nepal Current CEO: H. M. Bharuka Kansai Nerolac Paints is a stalwart in the industrial segment, dominating market shares in automotive and powder coating paints in India. With Japanese roots, its renowned for advanced technology products, mainly catering to industrial clients with high-quality, durable coatings. Their product portfolio embraces decorative and performance coating, underlining innovation. Also Read Top 17 Tata Motors Competitors & Alternatives in 2025 3. Akzo Nobel India (AkzoNobel) Product Type: Paints and Coatings Industry: Chemicals Founded Date: 1911 Founders: Bof', 'images': [{'url': 'https://www.marketing91.com/wp-content/uploads/2023/11/Berger-Paints-India.jpg', 'alt_text': 'Berger Paints India', 'width': '630', 'height': '360', 'class': 'aligncenter size-full wp-image-3650382', 'confidence': 0.8999999999999999}, {'url': 'https://www.marketing91.com/wp-content/uploads/2023/11/Kansai-Nerolac-Paints.jpg', 'alt_text': 'Kansai Nerolac Paints', 'width': '630', 'height': '360', 'class': 'aligncenter size-full wp-image-3650373', 'confidence': 0.8999999999999999}, {'url': 'https://www.marketing91.com/wp-content/uploads/2023/11/Akzo-Nobel-India-AkzoNobel.jpg', 'alt_text': 'Akzo Nobel India (AkzoNobel)', 'width': '630', 'height': '360', 'class': 'aligncenter size-full wp-image-3650380', 'confidence': 0.8999999999999999}, {'url': 'https://www.marketing91.com/wp-content/uploads/2023/11/Nippon-Paint.jpg', 'alt_text': 'Nippon Paint', 'width': '630', 'height': '360', 'class': 'aligncenter size-full wp-image-3650374', 'confidence': 0.8999999999999999}, {'url': 'https://www.marketing91.com/wp-content/uploads/2023/11/PPG-Industries.jpg', 'alt_text': 'PPG Industries', 'width': '630', 'height': '360', 'class': 'aligncenter size-full wp-image-3650375', 'confidence': 0.8999999999999999}], 'rank': 3}, {'url': 'https://civillane.com/market-share-of-paint-brands-in-india/', 'content': 'Market Share of Paint Brands in India 2025 | CivilLane Skip to content Facebook X YouTube Instagram Pinterest | Mumbai - 91720 73720 | 98197 18861 | 73043 13893 | | contact@civillane.com Home 3D Design Rs.15 Free Estimate Modular Kitchens Interiors Home Interiors Office Interiors Commercial Interiors True Cost Bath Redo Gallery Videos More Articles Webstories Materials Rate 1 BHK Interior Design 2 BHK Interior Design 3 BHK Interior Design Market Share of Paint Brands in India 2025 View Larger Image Introduction: The paints market in India is a dynamic and competitive industry, featuring key players that dominate the market share. As of 2023, Asian Paints stands as the market leader, holding a significant 59% share. Other major players include Berger Paints with 18%, Kansai Nerolac Paints with 15%, AkzoNobel (Dulux) with 7%, and various other players making up the remaining 1%. Market Share Breakdown (2023): Asian Paints: 59% Berger Paints: 18% Kansai Nerolac Paints: 15% AkzoNobel (Dulux): 7% Others: 1% Growth Prospects: The Indian paints market is poised for substantial growth, projected to achieve a Compound Annual Growth Rate (CAGR) of 9.38% from 2023 to 2028. This growth is attributed to factors such as increasing urbanization, rising disposable incomes, and a growing demand for both aesthetic and protective coatings. Segmentation: The decorative paints segment holds the lions share of the Indian paints market, constituting approximately 75% of the total market share. In contrast, the industrial paints segment accounts for the remaining 25%. Competitive Landscape: The Indian paints industry is anticipated to remain fiercely competitive, prompting key players to focus on strategies such as innovation, product differentiation, and market expansion. As the industry evolves, companies will likely explore new markets to sustain and augment their market positions. Disclaimer: Its essential to acknowledge that market share data can vary across different sources. The figures presented here are based on estimates derived from various industry reports. Stakeholders are encouraged to verify information from multiple sources for a comprehensive understanding of the market dynamics. By CivilLane | 2025-05-21T16:55:40+05:30 November 28th, 2023 | Categories: Building Materials | Tags: AkzoNobel (Dulux) , Asian Paints , Berger , Indian paints industry , Kansai Nerolac , Market Share of Paint Brands , Paint Brands In India | 0 Comments Share This Informative Post, Choose Your Platform! Facebook X LinkedIn WhatsApp Email Related Posts Top 9 Trends in Swimming Pool Tile Designs Gallery Top 9 Trends in Swimming Pool Tile Designs October 19th, 2023 | 1 Comment Large Format Tiles Outshining Marbles Gallery Large Format Tiles Outshining Marbles July 17th, 2023 | 0 Comments Top 5 Quartz Countertops Brands in India Gallery Top 5 Quartz Countertops Brands in India April 13th, 2023 | 0 Comments Top 5 Tile Adhesive Brands In India Gallery Top 5 Tile Adhesive Brands In India April 8th, 2023 | 0 Comments Leverage PLI to Save The Laminate Industry Gallery Leverage PLI to Save The Laminate Industry March 23rd, 2023 | 0 Comments Leave a comment Cancel reply 3D Interior Design Service FREE Estimate Book Your Interior Designer Web Stories Top 5 Door Lock Brands In India The Art of Feng Shui: Balancing Energy in Your Home Design Indian PVC Plastic Pipe Market Share Who Owns Ambuja Cement Top 5 Kitchen Countertops Options Categories 2D Interior Design 3D Interior Design Aluminium Window Apartments Bangalore 30 40 Plans Bathroom Building Materials Electrical Wiring False Ceiling Flooring Furniture Glass Partitions Granite Hindi Home Decor Home Interiors Home Renovation Interior Designer Interviews Italian Marble Modular Kitchen Office Design Painting Repair & Renovation Tips & Tricks Vastu Tips Wall Tiles Wallpaper Like us on Facebook CivilLane.com 2016 - 2025 | All Rights Reserved | Terms | About Us Facebook X YouTube Instagram Pinterest Page load link Top 5 D', 'images': [{'url': 'https://civillane.com/wp-content/uploads/2023/07/Large-Format-Tiles-why-they-are-a-better-option-than-Marble-or-Granites-500x383.jpg', 'alt_text': 'Large Format Tiles Outshining Marbles', 'width': '500', 'height': '383', 'confidence': 0.9999999999999999}, {'url': 'https://i0.wp.com/civillane.com/wp-content/uploads/2023/11/Market-Share-of-Paint-Brands-in-India.jpg?resize=1000%2C673&ssl=1', 'alt_text': 'Market Share of Paint Brands in India', 'width': '1000', 'height': '673', 'class': 'alignnone size-full wp-image-33301', 'confidence': 0.8999999999999999}, {'url': 'https://civillane.com/wp-content/uploads/2023/10/Top-9-Trends-in-Swimming-Pool-Tile-Designsmain-500x383.jpg', 'alt_text': 'Top 9 Trends in Swimming Pool Tile Designs', 'width': '500', 'height': '383', 'confidence': 0.8999999999999999}, {'url': 'https://civillane.com/wp-content/uploads/2023/04/Top-5-Quartz-Countertops-Manufacturer-Brands-In-India-500x383.jpg', 'alt_text': 'Top 5 Quartz Countertops Brands in India', 'width': '500', 'height': '383', 'confidence': 0.8999999999999999}, {'url': 'https://civillane.com/wp-content/uploads/2023/04/Top-5-Tile-Adhesive-Brands-In-India-500x383.jpg', 'alt_text': 'Top 5 Tile Adhesive Brands In India', 'width': '500', 'height': '383', 'confidence': 0.8999999999999999}], 'rank': 4}, {'url': 'https://bstrategyhub.com/asian-paints-competitors-and-alternatives/', 'content': 'Top 10 Asian Paints Competitors and Alternatives | Business Strategy Hub Home Strategies Competitive Strategy Red Queen Effect Blue Ocean Strategy Only the paranoid survives Co-opetition Strategy Marketing Strategy Mintzbergs 5 Ps Ansoff Matrix BCG Matrix Target Right Customers Product Strategy Product Life Cycle Diffusion of Innovation Theory Bowmans Strategic Clock Pricing Strategies Organizational Strategy 7S Framework Porters Five Forces Strategy Diamond Value Innovation Strategy Tools PESTLE Analysis Gap Analysis SWOT Analysis Strategy Canvas Business Model SWOT Mission & Vision Competitors Ownership Search Home Strategies Competitive Strategy Red Queen Effect Blue Ocean Strategy Only the paranoid survives Co-opetition Strategy Marketing Strategy Mintzbergs 5 Ps Ansoff Matrix BCG Matrix Target Right Customers Product Strategy Product Life Cycle Diffusion of Innovation Theory Bowmans Strategic Clock Pricing Strategies Organizational Strategy 7S Framework Porters Five Forces Strategy Diamond Value Innovation Strategy Tools PESTLE Analysis Gap Analysis SWOT Analysis Strategy Canvas Business Model SWOT Mission & Vision Competitors Ownership Search Search Competitors Top 10 Asian Paints Competitors and Alternatives Brianna Parker February 6, 2025 Add comment 9 min read Asian Paints is a multinational paint company based in Mumbai, Maharashtra, India. Champaklal Choksey, Chimanlal Choksi, Suryakant Dani, and Arvind Vakil founded the company in 1942. A temporary ban on paint imports during WWII and the Quit India Movement created an opportunity for Asian Paints to conquer the Indian market. By 1967, the company was Indias leading paint manufacturer. Asian Paints seeks to transform itself into a complete home decor and lifestyle brand. In May 2023, Asian Paints unveiled a 17,000 sq ft home decor studio in Chennai. This location showcases lighting, furniture, fixtures, furnishings, and home designs. [ 1 ] Asian Paints diversified its product portfolio through strategic acquisitions, including Sleek Kitchens and Ess Ess bath fittings. As of August 2023, the company operated 44 Beautiful Home Studios in India. Asian Paints MD & CEO Amit Syngle plans to increase Beautiful Home Studios to 65-70 in FY24. This move can help the company boost the home decor share to 8-10% of decorative revenues. Asian Paints acquired a 49% stake in lighting specialist White Teak and a 51% stake in window and door manufacturer Weatherseal in 2022. In June 2023, the company raised its stake in White Teak by 11% to 60%. Both White Teak and Weatherseal will help Asian Paints hedge risk by grabbing more opportunities in lucrative segments before competitors. The company faces stiff competition from Berger, Kansai Nerolac, AkzoNobel, Nippon Paint, Shalimar, Jotun, Snowcem, Indigo, JSW, and Sirca. [ 2 ] Here is an in-depth analysis of Asian Paints competitors and alternatives: Table of Contents Toggle 1. Berger Paints 2. Kansai Nerolac Paints 3. AkzoNobel 4. Nippon Paint 5. Shalimar Paints 6. Jotun Paints 7. Snowcem Paints 8. Indigo Paints 9. JSW Paints 10. Sirca Paints India 1. Berger Paints Year founded: 1923 Headquarter: Kolkata, India Berger is Indias second-largest paint company after Asian Paints. It offers interior and exterior paints, waterproofing solutions, wood coatings, and other specialty products across several countries. In Q1 2023, Berger Paints Nepal underperformed due to country-specific issues, but Berger Paints India reported a 40% increase in net profit. [ 3 ] Berger has a strong distribution network with over 25,000 dealers across India. As of March 2023, the company controlled 19.4%-19.5% share of Indias paints market. The paint manufacturer seeks to increase its market share to 20% in 2023. The business expanded its presence in rural areas and invested in R&D and technology to improve its distribution system and create eco-friendly products. Berger is the top competitor for Asian Paints. [ 4 ] This World Soil Day, embrace the shades of s', 'images': [{'url': 'https://bstrategyhub.com/wp-content/uploads/2023/12/Asian-Paints-Competitors-and-Alternatives-Featured-Image-by-Roselyn-Tirado.jpg', 'alt_text': 'Asian Paints Competitors and Alternatives Featured Image by Roselyn Tirado', 'width': '750', 'height': '500', 'class': 'attachment-gridlove-cover size-gridlove-cover wp-post-image', 'confidence': 0.8999999999999999}, {'url': 'https://bstrategyhub.com/wp-content/uploads/2023/11/Gopuff-Competitors-and-Alternatives-Featured-Image-by-Rowan-Freeman.jpg', 'alt_text': 'Gopuff Competitors and Alternatives Featured Image by Rowan Freeman', 'width': '385', 'height': '274', 'class': 'attachment-gridlove-b8 size-gridlove-b8 wp-post-image', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://bstrategyhub.com/wp-content/uploads/2021/12/udemy-competitors-image-credit-lewis-keegan-unsplash.jpg', 'alt_text': 'Udemy Competitors Image Credit Lewis Keegan Unsplash.', 'width': '385', 'height': '257', 'class': 'attachment-gridlove-b8 size-gridlove-b8 wp-post-image', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://bstrategyhub.com/wp-content/uploads/2023/04/fiserv-competitors-and-alternatives-featured-image-by-firmbee.com_.jpg', 'alt_text': 'fiserv competitors and alternatives featured image by firmbee.com', 'width': '385', 'height': '256', 'class': 'attachment-gridlove-b8 size-gridlove-b8 wp-post-image', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://bstrategyhub.com/wp-content/uploads/2022/12/top-lego-competitors-alternatives-featured-image-by-xavi-cabrera.jpg', 'alt_text': 'Top Lego Competitors Alternatives Featured Image By Xavi Cabrera', 'width': '385', 'height': '257', 'class': 'attachment-gridlove-b8 size-gridlove-b8 wp-post-image', 'loading': 'lazy', 'confidence': 0.8999999999999999}], 'rank': 5}, {'url': 'https://tradebrains.in/features/grasim-vs-asian-paints-who-will-dominate-the-paint-industry/', 'content': '[not extracted] Content limit reached', 'rank': 6}, {'url': 'https://thebrandhopper.com/2023/02/26/painting-a-picture-of-rivals-top-10-competitors-of-asian-paints-in-india/', 'content': '[not extracted] Content limit reached', 'rank': 7}, {'url': 'https://prismaneconsulting.com/blog-details/asian-paints-market-share-decline-amid-rising-competition-akzonobel-considers-exiting-indian-paints-business', 'content': '[not extracted] Content limit reached', 'rank': 8}]",
            "annotations": null
          }
        ]
      },
      "error": null,
      "cost": 0.0,
      "start_time": "2025-08-09T10:38:38.957271",
      "end_time": "2025-08-09T10:39:23.466263",
      "execution_time": 44.508992,
      "input_tokens": 0,
      "output_tokens": 0,
      "execution_result": null
    },
    {
      "id": "T004",
      "description": "Retrieve information on Asian Paints' product portfolio and market segmentation.",
      "agent": "RetrieverAgent",
      "agent_prompt": "Collect detailed information about Asian Paints' product portfolio, including different types of paints, coatings, and related products. Analyze the market segmentation strategy, identifying target customer segments and their specific needs and preferences. Include data on product sales, market share by product category, and product innovation pipeline.",
      "reads": [],
      "writes": [
        "T004"
      ],
      "status": "completed",
      "output": {
        "product_portfolio": [
          {
            "type": "text",
            "text": "[{'url': 'https://www.asianpaints.com/guides/paint-product-guide.html', 'content': 'Complete Paint Product Guide: Everything to Know - Asian Paints The Ultimate Guide to Mastering Paint Selection Colours Colour by family All Colours Grey Blue Brown Red Orange Yellow Green Purple Pink Whites Off Whites Colour Collections Royale Designer Colour of the year Colour Tools Home Colour Guide Wall Paint Finder Wood Paint Finder Wood Finish Visualiser Textures For You New Shade Cards New Inspirations Colour combinations Celebrity homes Products For Interior Walls Paints Textures Wallpapers For Exterior Walls Paints Textures Waterproofing All products Bathrooms Terrace & tanks Cracks & joints Interior Tiling Exteriors Other Surface Wood paints Metal paints Undercoats Adhesives Brushes & Ancillaries Shop DIY Tools Mechanized tools Colour books Royale play texture tool Services Painting Interior solutions Waterproofing Sleek Kitchen Bathroom design & execution Calculators Paint budget calculator Waterproofing budget calculator Interior design cost calculator Kitchen cost calculator Sustainability More Find Contractor Find a store Blogs Guides Paint bucket return Explore home decor Our Company Investors Careers Contact us Search for Get recommendations for Colour inspiration,Textures, Wallpapers, Interior Design ideas, etc... Drag & drop your image here or Browse an image Max file size limit is 5MB Only JPG, JPEG and PNG file formats are allowed Please upload only 1 file Oops file upload failed, please try again!!! Search with a photo Get recommendations for Colour inspiration,Textures, Wallpapers, Interior Design ideas, etc... Gallery - Choose an existing photo Camera - Click a photo Max file size limit is 5MB Oops file upload failed, please try again!!! Uploading... Find Contractor Store Profile Hello My Profile Wishlist Sign out Hello {{minicart.cartcount > 0 ? minicart.cartcount : 0}} Cart Processing... You have {{minicart.cartcount}} items {{item[\"totalPrice\"][\"value\"]}} - + Total Amount {{minicart.totalprice}} Checkout Your cart is empty Shop now Book Free Site Visit Colours Colour by family All Colours Grey Blue Brown Red Orange Yellow Green Purple Pink Whites Off Whites Colour Collections Royale Designer Colour of the year Colour Tools Home Colour Guide Wall Paint Finder Wood Paint Finder Wood Finish Visualiser Textures For You New Shade Cards New Inspirations Colour combinations Celebrity homes Products For Interior Walls Paints Textures Wallpapers For Exterior Walls Paints Textures Waterproofing All products Bathrooms Terrace & tanks Cracks & joints Interior Tiling Exteriors Other Surface Wood paints Metal paints Undercoats Adhesives Brushes & Ancillaries Shop DIY Tools Mechanized tools Colour books Royale play texture tool Services Painting Interior solutions Waterproofing Sleek Kitchen Bathroom design & execution Calculators Paint budget calculator Waterproofing budget calculator Interior design cost calculator Kitchen cost calculator Sustainability More... Find Contractor Find a store Blogs Guides Paint bucket return Explore home decor Our Company Investors Careers Contact us Book Free Site Visit Get recommendations for Colour inspiration,Textures, Wallpapers, Interior Design ideas, etc... Drag & drop your image here or Browse an image Max file size limit is 5MB Only JPG, JPEG and PNG file formats are allowed Please upload only 1 file Oops file upload failed, please try again!!! Search with a photo Get recommendations for Colour inspiration,Textures, Wallpapers, Interior Design ideas, etc... Gallery - Choose an existing photo Camera - Click a photo Max file size limit is 5MB Oops file upload failed, please try again!!! Uploading... The Ultimate Guide to Mastering Paint Selection Navigating Finishes, Properties, and More Selecting Paint According to Paint Types Selecting Paint According to Finishes Selecting Paint According to Properties Selecting Paint According to Climate & Surroundings Selecting Paint According to Rooms in Your Home Selecting Paint According to Budget How Can Asian Paints Help You With', 'images': [{'url': 'https://static.asianpaints.com/content/dam/apcolourcatalogue/splash-popup/mobile-home-decor-image.webp', 'alt_text': 'mobile-home-decor-image', 'width': '290', 'height': '260', 'loading': 'eager', 'confidence': 0.8999999999999999}, {'url': 'https://static.asianpaints.com/content/dam/apcolourcatalogue/splash-popup/mobile-paint-textures-image-40.webp', 'alt_text': 'mobile-paint-textures-image-40', 'width': '290', 'height': '260', 'loading': 'eager', 'confidence': 0.8999999999999999}, {'url': 'https://static.asianpaints.com/content/dam/apcolourcatalogue/asset/ap-revamp/design-guide/product-guide/sofa-for-living-room.png', 'alt_text': 'Living room sofa design - Asian Paints', 'title': 'Living room sofa design - Asian Paints', 'loading': 'eager', 'confidence': 0.7}, {'url': 'https://static.asianpaints.com/content/dam/apcolourcatalogue/asset/ap-revamp/design-guide/product-guide/paint-for-exterior.png', 'alt_text': 'Asian Paints | Selecting the Perfect Paint Guide - 2', 'title': 'Asian Paints | Selecting the Perfect Paint Guide - 2', 'loading': 'eager', 'confidence': 0.7}, {'url': 'https://static.asianpaints.com/content/dam/apcolourcatalogue/asset/ap-revamp/design-guide/product-guide/matte-paint-for-home.png', 'alt_text': 'Matte wall paint for home - Asian Paints', 'title': 'Matte wall paint for home - Asian Paints', 'loading': 'eager', 'confidence': 0.7}], 'rank': 1}, {'url': 'https://yespainter.com/asian-paints-product-list/', 'content': 'Asian Paints Product List Asian Paints Product List with Price- Painting service by Yes Painter Yes Painter Skip to content Home Products Asian Paints Interior Products Tractor Emulsion Premuim Emulsion Royale Luxury Emulsion Royale Matt Emulsion Royale Atmos Emulsion Royale Shyne Emulsion Royale Health Shield Royale Aspira Exterior Products Ace Sparc Emulsion Ace Exterior Emulsion Apex Exterior Emulsion Apex Ultima Exterior Emulsion Ultima Protek Exterior Emulsion Apex Ultima Protek Duralife Apex Tile Guard SmartCare Damp Sheath SmartCare Damp Proof Undercoats Trucare Interior Wall Primer Trucare Exterior Wall Primer Royale Base Coat Trucare Powder Wall Putty Trucare Acrylic Wall Putty Wood & Metal Apcolite Premium Enamel Apcolite Rust Shield WoodTech Melamyne WoodTech PU Pallete Berger Paint Interior Products Bison Acrylic Emulsion Commando Acrylic Paint Rangoli Total Care Emulsion Easy Clean Luxury Emulsionn Silk Glamor Luxury Emulsion Silk Breathe Easy Luxury Emulsion Silk Luxury Exterior Products Walmasta Antifungal Emulsion WeatherCoat All Guard WeatherCoat Anti Dust WeatherCoat Long Life 7 WeatherCoat Smooth WeatherCoat Glow WeatherCoat Champ WeatherCoat Long Life 10 Undercoats Bison Wall Putty Happy Wall Acrylic Putty WeatherCoat Exterior Primer BP Exterior Cement Primer BP White Interior Primer BP Interior Cement Primer Nerolac Paint Interior Products Beauty Smooth Emulsion Beauty Gold Emulsion Pearls Interior Emulsion Impressions 24 Carat Impressions Eco Clean Impressions Ideaz Pearls Lustre Finish Exterior Products Excel Anti Peel Emulsion Excel Mica Marble Excel Rain Guard Vertical Excel Rain Guard Horizontal Excel Tile Guard Excel Total All in One Suraksha Sheen Undercoats Cement Putty Wall Putty Acrylic Exterior Wall Primer Cement Primer Nippon Paint Interior Products Breeze Emulsion Vinilex Emulsion Atom 2 In 1 Spotless NXT Satin-Glo Aura Satin Glo+ Matex Ez Wash Matex Gold Exterior Products Shogun Emulsion Atom 2 In 1 Samurai Sumo Xtra Weatherond Advance Durafresh Xpert Weatherbond Pro Undercoats Wood Primer Exterior Wall Primer Interior Wall Primer Aqua Primer Walltron FR-Putty Indigo Paint Interior Products Bronze Interior Emulsion Acrylic Distemper Silver Acrylic Distemper Gold Silver Emulsion Series Bright Ceiling Coat Platinum Bright Ceiling Coat Gold Premium Emulsion Gold Sheen Emulsion Silver Luxury Interior Emulsion Exterior Products Gold Series Emulsion Premium XT Emulsion (Platinum Series) Dirtproof & Waterproof Laminate Undercoats ST Wood Primer Exterior Wall Primer Gold Series Water Thinnable Cement Primer Polymer Putty Silver Series Acrylic Wall Putty Gold Series Stencil Collection Kids Room Geometric Nature Inspired Magneto Border Ethnic All Over Interior Texture Special Effects Safari Infinitex Stucco Exterior Texture Visualiser Asian Paints Colours Berger Paint Colours Nippon Paint Colours Dulux Paint Colours Kansai Nerolac Colours Sherwin Williams Colours Services Interior Painting Exterior Painting Wood and Metal Texture Painting Touch-up Service Customised Decor Testimonials Projects Reviews Blogs Estimate Cost Home Products Asian Paints Interior Products Tractor Emulsion Premuim Emulsion Royale Luxury Emulsion Royale Matt Emulsion Royale Atmos Emulsion Royale Shyne Emulsion Royale Health Shield Royale Aspira Exterior Products Ace Sparc Emulsion Ace Exterior Emulsion Apex Exterior Emulsion Apex Ultima Exterior Emulsion Ultima Protek Exterior Emulsion Apex Ultima Protek Duralife Apex Tile Guard SmartCare Damp Sheath SmartCare Damp Proof Undercoats Trucare Interior Wall Primer Trucare Exterior Wall Primer Royale Base Coat Trucare Powder Wall Putty Trucare Acrylic Wall Putty Wood & Metal Apcolite Premium Enamel Apcolite Rust Shield WoodTech Melamyne WoodTech PU Pallete Berger Paint Interior Products Bison Acrylic Emulsion Commando Acrylic Paint Rangoli Total Care Emulsion Easy Clean Luxury Emulsionn Silk Glamor Luxury Emulsion Silk Breathe Easy Luxury Emulsion Silk Luxury Exterior Products Wa', 'images': [{'url': 'https://yespainter.com/wp-content/uploads/2021/04/Asian-Paints-Tractor-Emulsion-1-150x150.png', 'alt_text': 'Asian Paints Tractor Emulsion', 'width': '150', 'height': '150', 'class': 'img-responsive wp-image-5889', 'confidence': 0.7}, {'url': 'https://yespainter.com/wp-content/uploads/2021/04/Asian-Paints-Apcolite-Premium-Emulsion-150x150.png', 'alt_text': 'Asian-Paints-Apcolite-Premium-', 'width': '150', 'height': '150', 'class': 'img-responsive wp-image-5907', 'confidence': 0.7}, {'url': 'https://yespainter.com/wp-content/uploads/2021/05/Asian-paints-royal-luxury-150x150.png', 'alt_text': 'Asian paints royale luxury', 'width': '150', 'height': '150', 'class': 'img-responsive wp-image-6691', 'confidence': 0.7}, {'url': 'https://yespainter.com/wp-content/uploads/2021/05/Asian-Paints-Royale-Matt-150x150.png', 'alt_text': 'Asian-Paints-Royale-Matt', 'width': '150', 'height': '150', 'class': 'img-responsive wp-image-5939', 'confidence': 0.7}, {'url': 'https://yespainter.com/wp-content/uploads/2021/05/Asian-paints-Royale-Atmos111-150x150.png', 'alt_text': 'Asian-paints-Royale-Atmos', 'width': '150', 'height': '150', 'class': 'img-responsive wp-image-6792', 'confidence': 0.7}], 'rank': 2}, {'url': 'https://1pdf.in/asian-paints-products-list/', 'content': \"Asian Paints Products List with Price - 1PDF Asian Paints Products List with Price PDF General 0.43 MB / 12 Pages 0 likes like share this pdf Share DMCA / report this pdf Report Preview PDF Asian Paints Products List with Price Asian Paints offers a wide range of products across various categories including interior wall finishes, exterior wall finishes, metal finishes, wood finishes, undercoats, and more. Here is a comprehensive list of some of the key products offered by Asian Paints: Asian Paints All Products List Interior Wall Finishes Royale Atmos Royale Aspira Royale Luxury Emulsion Royale Shyne Luxury Emulsion Royale Matt Royale Health Shield Royale Play (special effects range) Tractor Emulsion Tractor Emulsion Shyne Apcolite Premium Emulsion Apcolite Advanced Emulsion Exterior Wall Finishes Apex Ultima Apex Ultima Protek Apex Ultima Protek Duralife Apex Weatherproof Emulsion Apex Shyne Apex Advanced Ace Exterior Emulsion Metal Finishes Apcolite Premium Gloss Enamel Apcolite Premium Satin Enamel Apcolite Advanced Gloss Enamel Apcolite Advanced Satin Enamel Asian Paints Woodtech PU Wood Finishes Woodtech PU (Polyurethane) Woodtech Melamyne Woodtech Touchwood Interior Woodtech Emporio PU Woodtech Aquadur PU Undercoats Trucare Interior Wall Primer Trucare Exterior Wall Primer Trucare Premium Wall Putty Trucare Exterior Wall Putty Trucare Acrylic Wall Putty Trucare Exterior P8rimer Trucare Interior Wall Primer (Water Thinnable) Apcolite Advanced Primer Waterproofing Solutions SmartCare Damp Proof SmartCare Damp Block 2K SmartCare Damp Sheath Exterior SmartCare Epoxy TriBlock SmartCare Tile Grout SmartCare Tile Adhesive SmartCare Crack Seal Designer Finishes Royale Play Metallics Royale Play Dune8 Royale Play Safari Royale Play Antico Royale Play Stucco Textures and Special Effects Royale Play Textures Royale Play Special Effects Royale Play Metallic Glaze Royale Play Glaze Others SmartCare Anti Termite Solution Trucare Wall Primer Cement Download Asian Paints Products List with Price PDF Free Download Recently Added PDF's Anandbazaar Patrika ( ) 70th National Film Awards Winners List OICL Assistant Recruitment 2025 Voter List 1995 West Bengal Voter List 2000 West Bengal Haryana CET Question Paper 2025 LBS Rank List 2025 TS Eamcet Web Options Colleges List Samras Hostel Merit List 2025 RGUKT Basar Selection Merit List 2025 PM Kisan 20th Installment Date List List of Indian Military Aircraft UP VDO Syllabus 2025 RSMSSB 4th Grade Syllabus Hindi 2025 DFCCIL Syllabus 2025 TNPSC Group 2 Syllabus 2025 1PDF or 1pdf.in does not claim to own any of the PDF contents including files and images of any formats, neither does it claims the accuracy of contents in the PDF files (PDF and Images). Read full disclaimer. 1PDF About Contact Privacy Policy copy url Welcome to 1PDF! Sign Up / Login Convert PDF to Images 1PDF Blog Categories Popular Topics About Contact Privacy Policy Disclaimer DMCA / Report Content\", 'images': [], 'rank': 3}, {'url': 'https://www.scribd.com/document/182832750/Asian-Paints-Products-details-docx', 'content': 'Asian Paints Products Details | PDF | Paint | Acrylic Paint Open navigation menu Close suggestions Search Search en Change Language Upload Sign in Sign in Download free for days 100% (3) 100% found this document useful (3 votes) 29K views 12 pages Asian Paints Products Details The document provides product specifications for various paints by Asian Paints. It includes details about the substrates, coverage in square feet per liter or kg, gloss/sheen, durability, a Full description Uploaded by abdulyunus_amir AI-enhanced title and description Download Save Save Asian Paints Products details.docx For Later Share 100% 100% found this document useful, undefined 0% , undefined Print Embed Report 100% (3) 100% found this document useful (3 votes) 29K views 12 pages Asian Paints Products Details The document provides product specifications for various paints by Asian Paints. It includes details about the substrates, coverage in square feet per liter or kg, gloss/sheen, durability, and application process for different product lines like Apex weatherproof emulsion, Royale Play special effects paint, Melamine clear finishes, PU interior and exterior clear coats, and others. Performance properties like scratch resistance, hardness, impact resistance, and non-yellowing properties are also mentioned. Read more Download 100% (3) 100% found this document useful (3 votes) 29K views 12 pages Asian Paints Products Details The document provides product specifications for various paints by Asian Paints. It includes details about the substrates, coverage in square feet per liter or kg, gloss/sheen, durability, a Full description Uploaded by abdulyunus_amir AI-enhanced title and description Carousel Previous Carousel Next Download Save Save Asian Paints Products details.docx For Later Share 100% 100% found this document useful, undefined 0% , undefined Print Embed Report Download Save Asian Paints Products details.docx For Later You are on page 1 / 12 Search Fullscreen Share this document Share on Facebook, opens a new window Share on LinkedIn, opens a new window Share with Email, opens mail client Copy link Millions of documents at your fingertips, ad-free Subscribe with a free trial Footer menu Back to top About About Scribd, Inc. Everand: Ebooks & Audiobooks SlideShare Join our team! Contact us Support Help / FAQ Accessibility Purchase help AdChoices Legal Terms Privacy Copyright Do not sell or share my personal information Social Instagram Instagram Facebook Facebook Pinterest Pinterest Get our free apps About About Scribd, Inc. Everand: Ebooks & Audiobooks SlideShare Join our team! Contact us Legal Terms Privacy Copyright Do not sell or share my personal information Support Help / FAQ Accessibility Purchase help AdChoices Social Instagram Instagram Facebook Facebook Pinterest Pinterest Get our free apps Documents Language : English Copyright 2025 Scribd Inc. We take content rights seriously. Learn more in our FAQs or report infringement here . We take content rights seriously. Learn more in our FAQs or report infringement here . Language : English Copyright 2025 Scribd Inc. 576648e32a3d8b82ca71961b7a986505', 'images': [], 'rank': 4}, {'url': 'https://gruhapraveshinteriors.com/all-asian-paints-products-list-price/', 'content': 'All Asian Paints Products List with Price Details-2023. - Gruha Pravesh Skip to content Gruha Pravesh Facebook Instagram Twitter Home Decor Kitchen Design a Room Designs Know Your Product Appliances Plywood Paints Home Improvement Planning Flooring Garden Vastu Furniture Resources About Us Contact Us Our Packages Blog Search Search for: Gruha Pravesh Search Search for: Menu Home Decor Kitchen Design a Room Designs Know Your Product Appliances Plywood Paints Home Improvement Planning Flooring Garden Vastu Furniture Resources About Us Contact Us Our Packages Blog Facebook Instagram Twitter Home Blog Paints All Asian Paints Products List with Price Details-2023. Paints 8 min read All Asian Paints Products List with Price Details-2023. admin 8 min read Updated On April 4, 2023 March 13, 2023 March 13, 2023 April 4, 2023 Write a Comment on All Asian Paints Products List with Price Details-2023. Want to know all Asian paints products list and their respective prices for various pack sizes with a detailed usage guide? Then Youve reached your destination. In this article, we are going to discuss Asian Paints price list for all its products like interior paints, exterior paints, Putty, primer, enamel paints, etc. with detailed product guides such as coverage, usage guide, shades, types, and all, so that you can select the one suits your requirement and budget. Asian Paints Logo Table of Contents Toggle About Asian Paints Asian Paints Price Asian Paints Products List & Price Details Asian Paints for interior walls Interior Wall Paints Asian Paints Royale Asian Paints Apcolite Asian Paints Tractor Interior Wall Textures Asian paints Royal Play Asian Paints for exterior walls Exterior Wall Paints Asian Paints Apex Ultima Asian Paints Apex Asian Paints Ace Exterior Wall Textures Asian Paints Apex Createx Asian Paints Ultima Allura Asian Paints Primer Asian Paints Wall Putty Asian Paints for wood Asian paints for Metal Asian Paints Rollers, Brushes & Ancillaries Asian Paints Wallpaper Conclusion About Asian Paints Asian Paints is one of the largest paint makers in the world. It was founded in 1942 and since then it has grown to become the largest paint manufactures in India. It has a presence in more than 60 countries and has over 60 manufacturing plants worldwide. Asian paints is a highly respected company in India due to its superior quality products, commitment, and innovation. It has been honored with multiple awards for its innovative products, ethical practices, and corporate governance policies. The company is a benchmark for many and often cited case studies in various business schools and management courses in India. Asian Paints Price Look, Asian Paints has a massive product line with various pack sizes, and its quite impossible for me to define all product prices for each pack size in a single article. So, we have to divide Asian paints products into various categories like Asian paints for interior, and exterior, Asian paints wall putty, Asian paints primer, Asian Paint Enamel, and many as it belongs to, and then define their prices for various pack sizes so that you can pick the product you want to know the price as mentioned below. Asian Paints Products List & Price Details The dominant paint brand has many types of paint products, from wall paint to wallpaper, from wood to metal, and from waterproofing solutions to adhesives. Below are the product categories of Asian Paints. Asian Paints for interior walls Asian Paints for exterior walls Asian Paints primer Asian Paints Putty Asian paints for wood Asian Paints for metal Asian Paints Brushes, rollers & Ancillaries Asian Paints wallpaper So, lets discuss all Asian paint products and their respective price list one by one. Asian Paints for interior walls Asian paints offer varieties of paints for interior walls like emulsion paints, acrylic emulsions, distempers, texture paints, etc. These paints are available in a wide range of colors, shades, and finishes. You can choose the o', 'images': [], 'rank': 5}, {'url': 'https://www.bccresearch.com/company-index/profile/asian-paints/products', 'content': '[not extracted] Content limit reached', 'rank': 6}, {'url': 'https://www.slideshare.net/Nirajkumar119/asian-paints-product-mix', 'content': '[not extracted] Content limit reached', 'rank': 7}, {'url': 'https://www.asianpaints.com/products.html', 'content': '[not extracted] Content limit reached', 'rank': 8}]",
            "annotations": null
          }
        ]
      },
      "error": null,
      "cost": 0.0,
      "start_time": "2025-08-09T10:39:28.477968",
      "end_time": "2025-08-09T10:40:16.464494",
      "execution_time": 47.986526,
      "input_tokens": 0,
      "output_tokens": 0,
      "execution_result": null
    },
    {
      "id": "T005",
      "description": "Retrieve information on Asian Paints' distribution network and supply chain.",
      "agent": "RetrieverAgent",
      "agent_prompt": "Gather data on Asian Paints' distribution network, including the number of distributors, retail outlets, and channels through which its products are sold. Analyze the supply chain, including sourcing of raw materials, manufacturing processes, and logistics. Identify key strengths and weaknesses in the distribution network and supply chain, and suggest potential improvements.",
      "reads": [],
      "writes": [
        "T005"
      ],
      "status": "running",
      "output": null,
      "error": null,
      "cost": 0.0,
      "start_time": "2025-08-09T10:40:21.473346",
      "end_time": null,
      "execution_time": 0.0
    },
    {
      "id": "T006",
      "description": "Retrieve information on Asian Paints' marketing and branding strategies.",
      "agent": "RetrieverAgent",
      "agent_prompt": "Collect data on Asian Paints' marketing and branding strategies, including advertising campaigns, promotional activities, sponsorships, and digital marketing initiatives. Analyze the effectiveness of these strategies in building brand awareness, customer loyalty, and market share. Include information on marketing spend, media mix, and key performance indicators (KPIs).",
      "reads": [],
      "writes": [
        "T006"
      ],
      "status": "pending",
      "output": null,
      "error": null,
      "cost": 0.0,
      "start_time": null,
      "end_time": null,
      "execution_time": 0.0
    },
    {
      "id": "T007",
      "description": "Retrieve information on Asian Paints' sustainability initiatives and corporate social responsibility (CSR) activities.",
      "agent": "RetrieverAgent",
      "agent_prompt": "Gather information on Asian Paints' sustainability initiatives and CSR activities, including environmental protection measures, community development programs, and ethical business practices. Analyze the company's commitment to sustainability and its impact on stakeholders. Include data on environmental performance, social impact, and governance practices.",
      "reads": [],
      "writes": [
        "T007"
      ],
      "status": "pending",
      "output": null,
      "error": null,
      "cost": 0.0,
      "start_time": null,
      "end_time": null,
      "execution_time": 0.0
    },
    {
      "id": "T008",
      "description": "Retrieve analyst reports and expert opinions on Asian Paints' future outlook and growth potential.",
      "agent": "RetrieverAgent",
      "agent_prompt": "Collect analyst reports and expert opinions on Asian Paints' future outlook and growth potential. Analyze the factors driving growth, such as market trends, technological innovation, and strategic initiatives. Include forecasts for revenue, profit, and market share. Identify potential risks and challenges facing the company, such as economic uncertainty, regulatory changes, and competitive pressures.",
      "reads": [],
      "writes": [
        "T008"
      ],
      "status": "pending",
      "output": null,
      "error": null,
      "cost": 0.0,
      "start_time": null,
      "end_time": null,
      "execution_time": 0.0
    },
    {
      "id": "T009",
      "description": "Generate graphs and tables for Asian Paints' revenue trend, market share, and financial performance.",
      "agent": "CoderAgent",
      "agent_prompt": "Based on the retrieved data from T002 and T003, generate the following visualizations using Python and appropriate libraries like matplotlib, seaborn, or plotly:\n\n1.  **Revenue Trend Graph:** A line graph showing Asian Paints' revenue trend over the past 5 years.\n2.  **Market Share Pie Chart:** A pie chart illustrating Asian Paints' market share compared to its major competitors.\n3.  **Financial Performance Table:** A table summarizing key financial metrics such as revenue, net profit, and operating expenses for the last 5 years.\n4.  **Profit Margin Graph**: Show the net profit margin over the last 5 years.\n\nEnsure that graphs are visually appealing and tables are well-formatted, with clear labels and units. Save all generated graphs as PNG images with descriptive filenames and save the table data into a JSON format. Provide the python code and the paths to the generated visualizations.",
      "reads": [
        "T002",
        "T003"
      ],
      "writes": [
        "T009"
      ],
      "status": "pending",
      "output": null,
      "error": null,
      "cost": 0.0,
      "start_time": null,
      "end_time": null,
      "execution_time": 0.0
    },
    {
      "id": "T010",
      "description": "Create a comprehensive and visually appealing HTML report on Asian Paints.",
      "agent": "FormatterAgent",
      "agent_prompt": "Based on the information gathered from T001, T004, T005, T006, T007, T008, and the visualizations generated in T009, create a comprehensive and visually appealing HTML report on Asian Paints. Include the following sections:\n\n1.  **Company Overview:** A brief introduction to Asian Paints, including its history, key milestones, and business overview, based on output of T001.\n2.  **Financial Performance:** An analysis of Asian Paints' financial performance over the past 5 years, including revenue, profit, and expenses, accompanied by the graphs and tables generated in T009.\n3.  **Market Position:** A discussion of Asian Paints' market share and competitive landscape, including key competitors and their respective strengths and weaknesses, accompanied by the graphs and tables generated in T009.\n4.  **Products and Services:** Details of Asian Paints' product portfolio and market segmentation, including target customer segments and their specific needs and preferences, based on the output of T004.\n5.  **Distribution Network and Supply Chain:** An overview of Asian Paints' distribution network and supply chain, including key strengths and weaknesses, based on the output of T005.\n6.  **Marketing and Branding Strategies:** An analysis of Asian Paints' marketing and branding strategies, including advertising campaigns, promotional activities, and digital marketing initiatives, based on the output of T006.\n7.  **Sustainability and CSR:** A discussion of Asian Paints' sustainability initiatives and CSR activities, including environmental protection measures, community development programs, and ethical business practices, based on the output of T007.\n8.  **Future Outlook:** An assessment of Asian Paints' future outlook and growth potential, based on analyst reports and expert opinions, from the output of T008.\n\nEnsure that the report is well-structured, visually appealing, and easy to read. Use appropriate headings, subheadings, bullet points, and images to enhance readability. The report should be thorough and insightful, providing a comprehensive overview of Asian Paints and its business operations.",
      "reads": [
        "T001",
        "T004",
        "T005",
        "T006",
        "T007",
        "T008",
        "T009"
      ],
      "writes": [
        "T010"
      ],
      "status": "pending",
      "output": null,
      "error": null,
      "cost": 0.0,
      "start_time": null,
      "end_time": null,
      "execution_time": 0.0
    }
  ],
  "links": [
    {
      "source": "ROOT",
      "target": "T001"
    },
    {
      "source": "ROOT",
      "target": "T002"
    },
    {
      "source": "ROOT",
      "target": "T003"
    },
    {
      "source": "ROOT",
      "target": "T004"
    },
    {
      "source": "ROOT",
      "target": "T005"
    },
    {
      "source": "ROOT",
      "target": "T006"
    },
    {
      "source": "ROOT",
      "target": "T007"
    },
    {
      "source": "ROOT",
      "target": "T008"
    },
    {
      "source": "T001",
      "target": "T010"
    },
    {
      "source": "T002",
      "target": "T009"
    },
    {
      "source": "T003",
      "target": "T009"
    },
    {
      "source": "T004",
      "target": "T010"
    },
    {
      "source": "T005",
      "target": "T010"
    },
    {
      "source": "T006",
      "target": "T010"
    },
    {
      "source": "T007",
      "target": "T010"
    },
    {
      "source": "T008",
      "target": "T010"
    },
    {
      "source": "T009",
      "target": "T010"
    }
  ]
}